{
	"version": "https://jsonfeed.org/version/1",
	"title": "Kev Quirk",
	"icon": "https://micro.blog/kq/avatar.jpg",
	"home_page_url": "https://qrk.social/",
	"feed_url": "https://qrk.social/feed.json",
	"items": [
		
			{
				"id": "http://kq.micro.blog/2023/10/11/having-a-microblog.html",
				"title": "Having a Microblog on a Traditional Blog",
				"content_html": "<!-- raw HTML omitted -->\n<pre><code>    &lt;p style=&quot;font-size:1.3rem;&quot; class=&quot;feed-email-link&quot;&gt;&lt;a href=&quot;mailto:23g@qrk.one?subject=Having a Microblog on a Traditional Blog&quot;&gt;Reply to this post by email&lt;/a&gt;&lt;/p&gt;\n</code></pre>\n",
				"content_text": "<p class=\"tldr\">I was recently talking to <a href=\"https://jatan.space\">Jatan Mehta</a> about microblogging vs traditional blogging, and what should go where. I thought it was an interesting conversation, so decided to share my opinions here too.</p>\n<p>I've written about <a href=\"https://kevquirk.com/anti-social-media\">my love/hate relationship with social media</a> in the past, and how <a href=\"https://kevquirk.com/anti-social-update\">I've changed my habits</a> to manage it better. I then toyed with <a href=\"https://kevquirk.com/micro-blog-is-still-confusing\">Micro.blog</a> and ultimately decided to just stick with <a href=\"https://fosstodon.org/kev\">Fosstodon</a>.</p>\n<p>When <a href=\"https://kevquirk.com/migrating-this-blog-to-kirby\">I switched to Kirby</a>, I thought it might be a good idea to build a \"notes\" section as a kinda self-hosted microblog, given that the Kirby panel is so powerful, this would be trivial to do.</p>\n<p>As a fellow (ex) member of Micro.blog, Jatan and I got into a conversation about microblogging and its benefits. I mentioned my idea for the \"notes\" section and Jatan replied with this comment:</p>\n<blockquote>\n<p>A “Notes” section on your blog could be interesting but I suppose when it comes to microblogging it’s not about the length of the content as much as the social space it provides, which is where Mastodon works good for some people including you. Might work if you could post notes on your blog as canonical and crosspost to Mastodon though.</p>\n</blockquote>\n<h2>Transient thoughts</h2>\n<p>This comment got me thinking about <em>what actually is a microblog</em>? And for me, it came down to <em>transient thoughts</em>. I use Fosstodon for 2 things:</p>\n<ol>\n<li>Sharing posts from this blog</li>\n<li>Sharing random thoughts that pop into my brain</li>\n</ol>\n<p>That's pretty much it. And for that, as Jatan quite rightly said, Mastodon is perfect. This blog is a place for my longer-form thoughts that I want to be out there in perpetuity, a microblog isn't that.</p>\n<h2>Ownership</h2>\n<p>My next thought then came down to ownership - by having the notes section I get to <em>own my content</em>. I'm in control of the domain and all the nuts and bolts that bring those transient thoughts together.</p>\n<p>But I'm the co-owner of Fosstodon, so that is true there as well. Even if I wasn't the co-owner, does it really matter if I don't own a gaggle of random, temporary thoughts?</p>\n<p>Probably not.</p>\n<h2>Final thoughts</h2>\n<p>All in all the whole \"notes\" thing is moot and I don't think I need to add it to this site. By doing so, I run the risk of muddying the waters here, and I already have a perfectly good platform that's <em>designed</em> for these thoughts, in Mastodon.</p>\n<p>So thanks for the chat, Jatan, I think I'll carry on as I am.</p>\n<p class=\"notice\">\nBy the way, Jatan is a prolific blogger. He maintains a very popular blog about space, as well as a personal blog. You can <a href=\"https://jatan.space\">check out his stuff here</a>.\n</p>\n\n        <p style=\"font-size:1.3rem;\" class=\"feed-email-link\"><a href=\"mailto:23g@qrk.one?subject=Having a Microblog on a Traditional Blog\">Reply to this post by email</a></p>\n",
				"date_published": "2023-10-11T13:40:00+01:00",
				"url": "https://qrk.social/2023/10/11/having-a-microblog.html"
			},
			{
				"id": "http://kq.micro.blog/2023/10/09/cms-filesize-comparison.html",
				"title": "CMS Filesize Comparison",
				"content_html": "<!-- raw HTML omitted -->\n<pre><code>          &lt;hr /&gt;\n      \n    \n    \n    &lt;p&gt;I thought this post was really interesting, and telling about the amount of bloat that a lot of CMS's have.&lt;/p&gt;\n</code></pre>\n<!-- raw HTML omitted -->\n<pre><code>    &lt;p style=&quot;font-size:1.3rem;&quot; class=&quot;feed-email-link&quot;&gt;&lt;a href=&quot;mailto:23g@qrk.one?subject=CMS Filesize Comparison&quot;&gt;Reply to this post by email&lt;/a&gt;&lt;/p&gt;\n</code></pre>\n",
				"content_text": "<h2>CMS Filesize Comparison</h2>\n              <span>by Eddie Dale</span>\n              <p markdown=\"1\">People probably disagree with the usefulness of a blunt size-comparison between CMS'es. But I find it a great indication of complexity vs simplicity, tendencies of bloat, load times.</p>\n              <p><b><a target=\"blank\" href=\"https://www.eddiedale.com/blog/cms-filesize-comparisons/\">Read Post →</a></b></p>\n\n              <hr />\n          \n        \n        \n        <p>I thought this post was really interesting, and telling about the amount of bloat that a lot of CMS's have.</p>\n<p>I was expecting WordPress to be heavy, but I was really surprised by the size of Craft and Stratamic. They're orders of magnitude bigger than Kirby.</p>\n<p>Really glad <a href=\"https://kevquirk.com/migrating-this-blog-to-kirby\">I switched</a>, now.</p>\n<p>I also <em>really</em> like how simple the design of Eddie's site is.</p>\n\n        <p style=\"font-size:1.3rem;\" class=\"feed-email-link\"><a href=\"mailto:23g@qrk.one?subject=CMS Filesize Comparison\">Reply to this post by email</a></p>\n",
				"date_published": "2023-10-09T16:45:00+01:00",
				"url": "https://qrk.social/2023/10/09/cms-filesize-comparison.html"
			},
			{
				"id": "http://kq.micro.blog/2023/10/08/absolutely-do-not.html",
				"title": "Absolutely Do Not Change Your Blogging Platform",
				"content_html": "<!-- raw HTML omitted -->\n<pre><code>    &lt;p style=&quot;font-size:1.3rem;&quot; class=&quot;feed-email-link&quot;&gt;&lt;a href=&quot;mailto:23g@qrk.one?subject=Absolutely Do Not Change Your Blogging Platform&quot;&gt;Reply to this post by email&lt;/a&gt;&lt;/p&gt;\n</code></pre>\n",
				"content_text": "<p>A couple of days ago, I was reading Manu's latest edition of People and Blog, in which he interviewed <a href=\"https://manuelmoreale.com/pb-andrea-contino\">Andrea Contino</a>.</p>\n<p>During the interview, Andrea linked to this post by Matt (who owns another blog that I regularly read and recommend you do too). Anyway, Matt's post is about not changing your blogging platform, which I do on the regular; the most recent of which was just <a href=\"https://kevquirk.com/migrating-this-blog-to-kirby\">a couple weeks ago</a>.</p>\n<p>While I agree with Matt in principle, I think it's ok to switch blogging platform, as long as your <a href=\"https://www.w3.org/Provider/Style/URI\">URLs don't change</a>. When I change platform, I try to make sure that my URLs don't change, and for anything that does change, like the link to <a href=\"https://kevquirk.com/feed\">my RSS feed</a> for example, I make sure there's redirects in place so nothing changes for my readers. Matt quite rightly mentions this in his post, to be fair.</p>\n<p>Once I've finished a migration, I then keep a very close eye on my 404 logs to see what's failed and if I need to either fix any links, or introduce more redirects that I hadn't thought of.</p>\n<p>Either way, this is a great post by Matt. Go read it. Make sure you check out <a href=\"https://peopleandblogs.com\">People and Blogs</a> too - there's some fantastic interviews on there so far.</p>\n\n        <p style=\"font-size:1.3rem;\" class=\"feed-email-link\"><a href=\"mailto:23g@qrk.one?subject=Absolutely Do Not Change Your Blogging Platform\">Reply to this post by email</a></p>\n",
				"date_published": "2023-10-08T17:25:00+01:00",
				"url": "https://qrk.social/2023/10/08/absolutely-do-not.html"
			},
			{
				"id": "http://kq.micro.blog/2023/10/03/fat-boy-at.html",
				"title": "Fat Boy at 40 - Update 01",
				"content_html": "<!-- raw HTML omitted -->\n<pre><code>    &lt;p style=&quot;font-size:1.3rem;&quot; class=&quot;feed-email-link&quot;&gt;&lt;a href=&quot;mailto:23g@qrk.one?subject=Fat Boy at 40 - Update 01&quot;&gt;Reply to this post by email&lt;/a&gt;&lt;/p&gt;\n</code></pre>\n",
				"content_text": "<p class=\"tldr\">It's been a little over a month since I mentioned the <a href=\"https://kevquirk.com/fat-boy-at-40\">Fat Boy at 40</a> thing (me wanting to lose some weight), so I thought it was hide time provided an update...</p>\n<p>So I've been tracking my weight, <a href=\"https://www.nhs.uk/live-well/healthy-weight/bmi-calculator/\">BMI</a> and blood pressure over the last 6 weeks. The good news is that my weight has gone down, as has my BMI and my blood pressure, but I think I could have done better.</p>\n<p>I've been keeping a week-by-week log of how I've done, those notes are below if you're interested in reading that, but the key take aways are that I'm making good progress with eating crap in the evening, and exercising, but I'm still struggling to get my weekends under control.</p>\n<p>Like I said in the last post though, this is a long-term change, so as long as my weight keeps trickling down, I'm happy.</p>\n<h2>The numbers</h2>\n<p>Ok, so here's the numbers so far:</p>\n<table>\n<thead>\n<tr>\n<th></th>\n<th>Original</th>\n<th>Current</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><strong>Weight</strong></td>\n<td>110.9kg (244lbs)</td>\n<td>108.4kg (238lbs)</td>\n</tr>\n<tr>\n<td><strong>BMI</strong></td>\n<td>30.7</td>\n<td>30</td>\n</tr>\n<tr>\n<td><strong>Blood Pressure</strong></td>\n<td>150/88</td>\n<td>125/73</td>\n</tr>\n</tbody>\n</table>\n<p>That's a total loss so far of 2.5kg (5.5lbs). While not great, it's still a loss and I'm headed in the right direction. What has really surprised me though, is how much my blood pressure has come down - that's a significant drop, and I'm really happy with that particular metric.</p>\n<h2>My weight loss weekly log</h2>\n<p>Below are the entries of my weight loss log. They're only a paragraph or so each, but provide more detail on how I've done week-by-week.</p>\n<h3>Mon 04 Sept 2023</h3>\n<p>Last week was my first week doing all this. I’m keeping the changes deliberately small, so I’ve made 3 small changes:</p>\n<ol>\n<li>Introduced 16:8 intermittent fasting, so I won’t eat after 19:00 - this means no more snacking in the evening</li>\n<li>Tried to make conscious choices with the food I eat, and drinking water when I get a hunger pang</li>\n<li>Moving more - taking the dogs for longer, harder (uphill) walks</li>\n</ol>\n<p>Generally it was a good week. I had 1 slip on Saturday where we were out for drinks with friends., I decided to snack when I get home, as I was a little drunk. But that’s fine - I need to be able to have fun too!</p>\n<p>Weight loss wasn’t as good as I’d hoped for this week, 0.4KG, but it’s still a loss and I’m trying to focus on that. Need to try and not be deflated by this - it’s a loss, that’s a good thing.</p>\n<p>Current weight is 110.5KG and BMI is 30.6.</p>\n<h3>Mon 11 Sept 2023</h3>\n<p>I don’t think I had a great week this week. It’s been REALLY hot, so I haven’t had the opportunity to get out for long walks with the dogs. I have still been managing to get out during my lunch break in work, but it’s very flat at the office, so my heart rate doesn’t really get going.</p>\n<p>Food wise, things are going ok I suppose. I’m managing to stave off the hunger pangs in the evening, and it’s starting to get a lot easier. I rarely notice them now, so that’s good. Generally my eating has been ok this week…for the most part. We did get take out on Friday as a treat, and we had pizza for dinner on Saturday because my wife and I were so busy, we ran out of time to cook something decent. So we just had to threw some pizza in the oven. I’ve also reduced the amount of sugar I have in my coffee from 1 teaspoon, to half a teaspoon. My goal is to cut this out completely - I used to have 2 sugars, so I’m sure I’ll be able to do this. I also think there’s too much salt in my diet - I tend to put some salt on pretty much every evening meal, so I’m trying to cut that down too.</p>\n<p>With the take out, pizza and reduction in activity thanks to the heat, I was expecting to be flat at best this week, but I was really surprised this morning when the scales read a weight of 108.8kg - that’s a total loss of 2.1kg (4.6lbs) so far. My BMI has also reduced a little bit too, it’s now down to 30.1.</p>\n<p>Really happy with those results and it’s spurred me on to keep going.</p>\n<h3>Mon 18 Sept 2023</h3>\n<p>Not a great week this week. Had some very healthy and gorgeous meals during the week, but it all went to shit at the weekend. We had take out on Friday, then just ate crap all weekend as and when we could, because we were so busy (as always). I really need to be cognisant of that during the weekend - I’m ok during the week, but for the last 2 weekends, I’ve let go a little. I’m using the excuse that we’re too busy to cook proper meals, but it’s no excuse really. We just need to be better at planning our time at the weekend. Or if my wife says she’s gonna cook pizza for the kids, I won’t partake. Instead opting for something more healthy.</p>\n<p>I’ve put a little bit of weight on this week, but honestly, I was expecting it to be worse; +200g, making my current weight 109.1kg - that’s a total weight loss of 1.8kg (4lbs) and a BMI of 30.2.</p>\n<p>We go again this week…</p>\n<h3>Mon 25 Sept 2023</h3>\n<p>I’ve been better this week - I feel like my eating has improved from last week. I’ve had no instances of snacking, and I’ve been busy at home too, so burning extra calories. Today’s weigh in was much more positive than last week - I’m down a full kilogram, to 108.1kg, resulting in a total loss of 2.8kg (6.2lbs) so far. Also, this has now brought my BMI down to 29.9, so I’m no longer obese, I’m just overweight haha.</p>\n<p>I think I’ve turned a corner this week. The hunger pangs are all but gone in the evening and I think I’m making better decision with my food. Not only that, but I feel more energetic and I’m sleeping better too.</p>\n<p>Let’s hope it continues this week.</p>\n<h3>Monday 02 October 2023</h3>\n<p>I’ve fallen off the wagon again this week. Nothing drastic, but enough to make me put on a little bit of weight. Basically, my wife went away with our next door neighbour and a couple of other friends, so I had beers with the other half of our next door neighbour’s marriage, then preceded to eat take out and crap all weekend.</p>\n<p>This has resulted in a gain of 0.3kg, making my total weight 108.4kg, resulting in a total loss so far of 2.5kg (5.5lbs). I’m not snacking or anything like that still, so it’s all good - I just need to get these weekends under control. It seems that if I fall off the wagon at any point during the weekend, I just think “fuck it” then go crazy for the entire weekend. I need to stop doing that…</p>\n<h2>Final thoughts</h2>\n<p>So far, so good, I think. I've lost a bit of weight, and my bloody pressure has really dropped. I'm also more active, and generally feeling more healthy. All positive.</p>\n<p>The changes I've made so far are pretty much habitual at this point, so I think I'll start looking for the next change to make soon - maybe some short jogging, but I'll have to see how my knees hold up to that...</p>\n\n        <p style=\"font-size:1.3rem;\" class=\"feed-email-link\"><a href=\"mailto:23g@qrk.one?subject=Fat Boy at 40 - Update 01\">Reply to this post by email</a></p>\n",
				"date_published": "2023-10-03T16:10:00+01:00",
				"url": "https://qrk.social/2023/10/03/fat-boy-at.html"
			},
			{
				"id": "http://kq.micro.blog/2023/09/30/migrating-this-blog.html",
				"title": "Migrating This Blog to Kirby",
				"content_html": "<!-- raw HTML omitted -->\n<pre><code>    &lt;p style=&quot;font-size:1.3rem;&quot; class=&quot;feed-email-link&quot;&gt;&lt;a href=&quot;mailto:23g@qrk.one?subject=Migrating This Blog to Kirby&quot;&gt;Reply to this post by email&lt;/a&gt;&lt;/p&gt;\n</code></pre>\n",
				"content_text": "<p class=\"tldr\">Yes, that's right dear reader, this site has gone through yet another change - it's now based on <a href=\"https://getkirby.com\">Kirby</a> and I think I've finally found <a href=\"https://kevquirk.com/my-blogging-utopia\">my blogging utopia</a>.</p>\n<p>Most regular readers will know that I struggle to stick with a single blogging platform. This is because I'm always on the hunt for something better, and I really enjoy learning new tools.</p>\n<p>This time around, I've flipped from <a href=\"https://blot.im\">Blot</a> to <a href=\"https://getkirby.com\">Kirby</a>. I have to say, I've really enjoyed learning Kirby - don't get me wrong, it's been a challenge as I'm not a PHP developer, but it's been fun learning.</p>\n<h2>CMS? Git? Text editor?</h2>\n<p>I tend to flip-flop around different tools as none of them have a perfect workflow for me. For example, I love <a href=\"https://kevquirk.com/the-wonderful-world-of-wordpress-wizardry-for-working-with-websites\">the WordPress CMS</a>, but there's lots of features in WP that I don't use, so it would be good if I could edit the CMS UI to only display what I actually use.</p>\n<p class=\"notice\">I realise that the WP UI can be customised with plugins and code, but it's not really designed to do that. I want something native that I can use how I want.</p>\n<p>I also really like the simplicity of a static site generator, like Jekyll or Blot, with a Git workflow that automatically publishes changes to the site.</p>\n<p>Sometimes I wanna use a CMS that I can login to, other times I want to write something in my text editor and publish it via Git. It just depends on how I feel. Problem is, nothing I've tried in the past can easily do both.</p>\n<p>But Kirby can...</p>\n<h2>The CMS</h2>\n<p>Kirby comes with a fantastic CMS, dubbed the \"Panel\". Out of the box it's really bare bones, but it's <em>designed</em> to be customised to the site owner's needs. To do this, Kirby uses \"<a href=\"https://getkirby.com/docs/reference/panel/blueprints\">blueprints</a>\" to customise pretty much every aspect of the Panel UI.</p>\n<p>For example, here's a look at the homepage of my Panel. I've customised it so that blog posts and drafts take up the majority of the page, but I can also see the pages I have on the site, as well as a handy-dandy Git status for the site too:</p>\n<figure><img alt=\"My Kirby panel homepage\" loading=\"lazy\" src=\"https://kevquirk.com/media/pages/blog/migrating-this-blog-to-kirby/36e54b2618-1696085781/my-kirby-panel.webp\"></figure>\n<p>Then, when editing posts, like this very post, I have another blueprint. I don't need feature images, template selectors, SEO gubbins and all that other noise WordPress offers. But if I did, I could easily add those fields to my <code>article</code> blueprint. It's all just YAML.</p>\n<figure><img alt=\"My Kirby post editor\" loading=\"lazy\" src=\"https://kevquirk.com/media/pages/blog/migrating-this-blog-to-kirby/bb3d1a6f1c-1696085934/kirby-post-editor.webp\"></figure>\n<p>I can go one step further and setup blueprints for pretty much any aspect of the site. For example (with <em>a lot</em> of help from <a href=\"https://manuelmoreale.com\">Manu Moreale</a>) I was able to create a blueprint for all the watches in <a href=\"https://kevquirk.com/watches\">my collection</a>:</p>\n<figure><img alt=\"Watches panel page\" loading=\"lazy\" src=\"https://kevquirk.com/media/pages/blog/migrating-this-blog-to-kirby/7b9ce729b3-1696086123/watches-panel-page.webp\"><figcaption>The main watches page</figcaption></figure>\n<figure><img alt=\"Single watch item editor page\" loading=\"lazy\" src=\"https://kevquirk.com/media/pages/blog/migrating-this-blog-to-kirby/d8e928724c-1696086132/single-watch-item.webp\"><figcaption>An example of a single watch in my collection</figcaption></figure>\n<p>This can be done for all kinds of thing. I have a blueprints for images, so whenever I click on an image in the panel, I can add custom attributes like <code>alt</code>, CSS <code>class</code> and lazy loading.</p>\n<p>The Kirby Panel is ridiculously powerful - I've never known anything like it. Seriously, it's a joy to use.</p>\n<h2>Text files and Git?</h2>\n<p>But what if I want to use good old text files and Git to push changes to my site? You know, kinda like a static site generator. Well dear reader, Kirby has me covered again.</p>\n<p>It's not quite the same as an SSG in that there's no frontmatter on Kirby, but there is something very similar. If I want to write a post manually, I'd just create a new sub-folder beneath my home page in the folder tree, then add a file called <code>article.txt</code> so Kirby knows to use my <code>article</code> template to display the page.</p>\n<p>Then I just add the contents as follows:</p>\n<pre><code>Title: This is the post title\n----\nDescription: This is the meta description for the post\n----\nPublished: 2023-09-30 15:21\n----\nTags: Opinion, Meta\n----\nText: This is where the main content for the post goes. Just write some **markdown** here and Kirby will do the rest.</code></pre>\n<p>It really is as simple as that. You already saw that I have Git integrated into my Kirby Panel thanks to <a href=\"https://getkirby.com/plugins/oblik/git\">this plugin</a>. So once I'm done, I just push the changes to Github, and Kirby will do the rest.</p>\n<p>It's so simple, yet so flexible.</p>\n<h2>The negatives</h2>\n<p>The only negative I've really found with Kirby so far, is <em>my</em> lack of knowledge. It was really difficult for me to wrap my head around the various parts of Kirby, but things are starting to click into place and make sense now. It was the same when I started developing with WordPress.</p>\n<p>I've already mentioned the huge amount of help I got from my friend Manu, but even if you don't have your very own Manu, like me, the <a href=\"https://forum.getkirby.com\">Kirby forums</a> are <em>spectacularly good</em>. The Kirby team have people on the payroll (I think) that assist in the forums. While I was setting up my Kirby site, I asked <em>a lot</em> of questions on the forum. Every single time I received a solution, and I <em>never</em> waited more than a couple of hours for a response.</p>\n<p>I've never know anything like it. The Kirby forums are incredibly good.</p>\n<h3>Price</h3>\n<p>Kirby isn't free. A license costs are around £100 for a site, which lasts for an entire major release. Kirby is about to hit version 4.0, so if you buy a license now, even though they're still on v3.x, the license will carry over to version 4, which I think is great.</p>\n<p class=\"notice\">The Kirby team released some info on <a href=\"https://forum.getkirby.com/t/news-about-our-v4-pricing-model/29661\">their new (and very fair IMO) pricing model</a>.</p>\n<p>I don't actually see this as a negative. Some people might, which is why I'm mentioning it, but I think it's very important to financial support these kind of indie projects. And by having a cost associated with all major releases, it means Kirby has an ongoing source of income.</p>\n<p>It's also worth mentioning that you can download and use Kirby indefinitely on a local development environment, it's only when the site is published to the internet that a license is required. Again, I think this is a great as it allows people to try before they buy.</p>\n<h2>Final thoughts</h2>\n<p>I'm <em>really</em> happy with my new Kirby powered site. It's so damn flexible, yet powerful. At this point, with the blueprints I've setup, it feels like I have my own, custom-made CMS that's designed <em>just for me</em>.</p>\n<p><strong>That's bloody impressive!</strong></p>\n<p>You know me, dear reader, a year from now I could well be running something completely different to power this blog. But honestly, I really doubt it as this is the first platform I've used that <em>legitimately</em> ticks <strong>all</strong> my boxes.</p>\n<p>If you're thinking about starting a new blog, or changing the platform your existing blog is based on, I'd strongly suggest you try Kirby.</p>\n<p>Lastly, I'd like to thank both <a href=\"https://manuelmoreale.com\">Manu Moreale</a> and <a href=\"https://forum.getkirby.com/u/texnixe/summary\">Sonja Broda</a>. Manu went above and beyond with the help he gave me, and Sonja - who's on the Kirby team - was the person that most often replied to <a href=\"https://forum.getkirby.com/u/kevq/activity\">my noobish forum posts</a>. She was always patient with me, and always gave me the solution I needed.</p>\n<p>Once I become more comfortable with the inner workings of Kirby, I intend to float around the Kirby forums to try and give something back to the community.</p>\n\n        <p style=\"font-size:1.3rem;\" class=\"feed-email-link\"><a href=\"mailto:23g@qrk.one?subject=Migrating This Blog to Kirby\">Reply to this post by email</a></p>\n",
				"date_published": "2023-09-30T16:40:00+01:00",
				"url": "https://qrk.social/2023/09/30/migrating-this-blog.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/09/28/stuck-in-the.html",
				"title": "Stuck in the Chicken Coop 😂",
				"content_html": "<!-- raw HTML omitted -->\n<pre><code>    &lt;p style=&quot;font-size:1.3rem;&quot; class=&quot;feed-email-link&quot;&gt;&lt;a href=&quot;mailto:23g@qrk.one?subject=Stuck in the Chicken Coop 😂&quot;&gt;Reply to this post by email&lt;/a&gt;&lt;/p&gt;\n</code></pre>\n",
				"content_text": "<p>This evening, while my wife was putting the kids to bed, she asked me if I'd go and check on the chickens as it was getting dark. Being the dutiful husband that I am, I trotted off up the field to make sure they were all settled down for the evening and that they were safe.</p>\n<p>While I was checking on them, the door to the coop blew shut and inadvertently dropped one of the bolts that locks the door...those bolts are on the <em>outside</em> of the coop. I was on the <em>inside</em> of it.</p>\n<p>Luckily for me, I had my phone with me, so was able to phone my wife for help. She came and set me free...eventually.</p>\n<p>Since I had my phone with me, and I was waiting for my wife to (eventually) save me, I decided to shoot a little video of the situation. Here's that video... 😂</p>\n<iframe width=\"362\" height=\"644\" src=\"https://www.youtube.com/embed/m9OYbSHWtRA\" title=\"Stuck in the Chicken Coop 😂\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n\n        <p style=\"font-size:1.3rem;\" class=\"feed-email-link\"><a href=\"mailto:23g@qrk.one?subject=Stuck in the Chicken Coop 😂\">Reply to this post by email</a></p>\n",
				"date_published": "2023-09-28T19:55:00+01:00",
				"url": "https://qrk.social/2023/09/28/stuck-in-the.html"
			},
			{
				"id": "http://kq.micro.blog/2023/09/27/thing-is-the.html",
				"title": "\u0026#8220;Thing\u0026#8221; Is the Worst Word in the English Language",
				"content_html": "<!-- raw HTML omitted -->\n<pre><code>    &lt;p style=&quot;font-size:1.3rem;&quot; class=&quot;feed-email-link&quot;&gt;&lt;a href=&quot;mailto:23g@qrk.one?subject=&amp;#8220;Thing&amp;#8221; Is the Worst Word in the English Language&quot;&gt;Reply to this post by email&lt;/a&gt;&lt;/p&gt;\n</code></pre>\n",
				"content_text": "<p class=\"tldr\">I absolutely hate the word \"thing\". Like, seriously, what value does that word have? It adds nothing to a conversation and should be erased from the dictionary.</p>\n<p>Picture the scene, dear reader; I'm in one room, and my kids are in another. Then, out of nowhere, one of them shouts:</p>\n<blockquote>\n<p>Daaaaaaaaad, what's this thing here?</p>\n</blockquote>\n<p>To which I usually respond with something like <em>\"what thing? use your bloody words!\"</em> And to my great annoyance, their response is usually something like:</p>\n<blockquote>\n<p>This little thing by my bed.</p>\n</blockquote>\n<p>How the fuck am I supposed to know what that <em>\"little thing\"</em> is next to your bed? I'm in another bloody room!</p>\n<p class=\"notice\">I don't use words like \"fuck\" in front of my kids. I'm just saying this for effect, chill your boots.</p>\n<p>Then, a few minutes later I'll be met with a similar comment from my wife...</p>\n<blockquote>\n<p>Kev, why has the light gone off on that thing in the bedroom?</p>\n</blockquote>\n<p>I get even more annoyed at my wife when she does this as she should know better.</p>\n<p><em>\"USE YOUR FUCKING WORDS!!\"</em></p>\n<p>My wife usually gets annoyed at me at this point - understandably since I just swore at her - but in my defence, she is a grown fucking woman...and a teaching assistant at that. If there's <em>anyone</em> who should know how to use proper words, it's her!</p>\n<p>The response I get back is often something like:</p>\n<blockquote>\n<p>Ok, moody-arse...I'm talking about the round, white internet thing that's under the chair in the bedroom. Why is the light off?\"</p>\n</blockquote>\n<p><em><strong>\"THANK YOU!</strong> I can work with that...that's the access point and the lights go off in the evening so they don't annoy us in bed.\"</em></p>\n<p>Like, was it really that hard to form that sentence? I don't think so.</p>\n<h2>Please stop using \"thing\"</h2>\n<p>I'd like to start a petition, dear reader. The next time you hear someone describing an object as <em>\"that thing\"</em> you have my permission to slap their face.</p>\n<p><em>\"Thing\"</em> is an atrocious word that has no place being used as an adjective. It's a useless supplement for the tens of thousands of wonderful words we have in the English language.</p>\n<p>Please, stop doing this <em>thing</em>.</p>\n\n        <p style=\"font-size:1.3rem;\" class=\"feed-email-link\"><a href=\"mailto:23g@qrk.one?subject=&#8220;Thing&#8221; Is the Worst Word in the English Language\">Reply to this post by email</a></p>\n",
				"date_published": "2023-09-27T17:55:00+01:00",
				"url": "https://qrk.social/2023/09/27/thing-is-the.html"
			},
			{
				"id": "http://kq.micro.blog/2023/09/26/outland.html",
				"title": "Outland",
				"content_html": "<!-- raw HTML omitted -->\n<pre><code>    &lt;p style=&quot;font-size:1.3rem;&quot; class=&quot;feed-email-link&quot;&gt;&lt;a href=&quot;mailto:23g@qrk.one?subject=Outland&quot;&gt;Reply to this post by email&lt;/a&gt;&lt;/p&gt;\n</code></pre>\n",
				"content_text": "<div class=\"book\">\n  <figure class=\"floatleft\"><img alt=\"Outland book cover\" src=\"https://kevquirk.com/media/pages/blog/outland/54a1b1749b-1695904245/outland-cover.webp\"></figure>\n  <p>✍️ <b>Written by:</b> Dennis E Taylor<br>\n  🏷 <b>Genre:</b> Sci-fi / fantasy<br>\n  🗓 <b>Published:</b> 01 January 2015<br>\n  📄 <b>Pages:</b> 360<br>\n  🧐 <b>My rating:</b> ★★★★★ / 5 stars</p>\n  <div class=\"spacer\"></div>\n  <p>When an experiment to study quantum uncertainty goes spectacularly wrong, physics student Richard and his friends find that they have accidentally created an inter-dimensional portal. They connect to an alternate Earth with identical geology, but where humans never evolved. They go panning for gold and become millionaires overnight, while fantasizing about Nobel Prizes and patents. <br>\n<br>\nThen the Yellowstone supervolcano erupts on Earth in an explosion large enough to destroy civilization and kill half the planet. Richard and his friends have less than an afternoon to get as many people as possible across to Outland before Nebraska is covered in a lethal cloud of ash.<br>\n<br>\nNow Richard finds himself in charge of a disorganized and frightened band of reluctant pioneers, on a world with none of the modern infrastructure that people have come to depend on. Richard has been a loner all his life, and has always wanted to be part of something bigger– but this is far more than he bargained for. If he doesn’t get this right, it’s not just the lives of the people in his care that could be lost– it may very well be the end of human civilization.</p>\n</div>\n<p><a class=\"button\" href=\"https://amzn.to/3rrfiom\"> Buy on Amazon</a></p>\n<p>In stark contrast to <a href=\"https://kevquirk.com/metro-2034\">the last book I read</a>, I absolutely loved <em>Outland</em>. This came as a recommendation on Mastodon, and I'm really glad I took the advice.</p>\n<p>It's a short book, at only 300 or so pages, but it's such an interesting read. I like the way Taylor focusses on the challenges the students have as they are responsible for hundreds of refugees all of a sudden. They're basically making it up as they go along, and having to constantly think outside the box. These aren't heroes, they're just kids trying to do the best they can, and everyone loves an underdog, right?</p>\n<p>I can't wait to get started on the second book.</p>\n\n        <p style=\"font-size:1.3rem;\" class=\"feed-email-link\"><a href=\"mailto:23g@qrk.one?subject=Outland\">Reply to this post by email</a></p>\n",
				"date_published": "2023-09-26T10:15:00+01:00",
				"url": "https://qrk.social/2023/09/26/outland.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/09/25/metro.html",
				"title": "Metro 2034",
				"content_html": "<!-- raw HTML omitted -->\n<pre><code>    &lt;p style=&quot;font-size:1.3rem;&quot; class=&quot;feed-email-link&quot;&gt;&lt;a href=&quot;mailto:23g@qrk.one?subject=Metro 2034&quot;&gt;Reply to this post by email&lt;/a&gt;&lt;/p&gt;\n</code></pre>\n",
				"content_text": "<div class=\"book\">\n  <figure class=\"floatleft\"><img alt=\"Metro 2034 book cover\" src=\"https://kevquirk.com/media/pages/blog/metro-2034/6ed9005d1d-1695904245/metro-2034.webp\"></figure>\n  <p>✍️ <b>Written by:</b> Dmitry Glukhovsky<br>\n  🏷 <b>Genre:</b> Sci-fi / fantasy<br>\n  🗓 <b>Published:</b> 16 March 2009<br>\n  📄 <b>Pages:</b> 526<br>\n  🧐 <b>My rating:</b> ★☆☆☆☆ / 1 star</p>\n  <div class=\"spacer\"></div>\n  <p>The basis of two bestselling computer games Metro 2033 and Metro Last Light, the Metro books have put Dmitry Glukhovsky in the vanguard of Russian speculative fiction alongside the creator of Night Watch, Sergei Lukyanenko.<br>\n<br>\nA year after the events of METRO 2033 the last few survivors of the apocalypse, surrounded by mutants and monsters, face a terrifying new danger as they hang on for survival in the tunnels of the Moscow Metro.<br>\n<br>\nFeaturing blistering action, vivid and tough characters, claustrophobic tension and dark satire the Metro books have become bestsellers across Europe.</p>\n</div>\n<p><a class=\"button\" href=\"https://amzn.to/48EfCkq\"> Buy on Amazon</a> &nbsp;&nbsp;&nbsp;&nbsp; <a class=\"button\" href=\"https://www.kobo.com/gb/en/search?query=metro+2034\">Buy on Kobo</a></p>\n<p>I was really disappointed with this book, so much so that I think this is the first 1 star rating I've given.</p>\n<p>After <a href=\"https://kevquirk.com/metro-2033\">the first book</a>, I was excited to get going on number 2, but the story just felt more of the same and offered nothing new.</p>\n<p>The characters were crap, the story was crap (as nothing really happened) and the ending was <em>really</em> crap. I've already bought the 3rd book in the series, but I'm regretting that now as I doubt I'll read it.</p>\n\n        <p style=\"font-size:1.3rem;\" class=\"feed-email-link\"><a href=\"mailto:23g@qrk.one?subject=Metro 2034\">Reply to this post by email</a></p>\n",
				"date_published": "2023-09-25T13:30:00+01:00",
				"url": "https://qrk.social/2023/09/25/metro.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/09/13/thinking-im-gonna.html",
				
				"content_html": "<p>Thinking I&rsquo;m gonna cancel my subscription here, so this may well be my last post. 🤷‍♂️</p>\n<p>You can find me on Mastodon, if you&rsquo;re interested in my waffle - <a href=\"https://fosstodon.org/@kev\">https://fosstodon.org/@kev</a></p>\n",
				"content_text": "Thinking I'm gonna cancel my subscription here, so this may well be my last post. 🤷‍♂️\r\n\r\nYou can find me on Mastodon, if you're interested in my waffle - [https://fosstodon.org/@kev](https://fosstodon.org/@kev)\r\n",
				"date_published": "2023-09-13T20:04:19+01:00",
				"url": "https://qrk.social/2023/09/13/thinking-im-gonna.html"
			},
			{
				"id": "http://kq.micro.blog/2023/09/12/finished-reading-metro.html",
				
				"content_html": "<p>Finished reading Metro 2033 by Dmitry Glukhovsky. Enjoyable book - well worth a read.<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/metro-2033\">https://kevquirk.com/metro-2033</a><!-- raw HTML omitted --></p>\n",
				"content_text": "Finished reading Metro 2033 by Dmitry Glukhovsky. Enjoyable book - well worth a read.   \r\n                <br><a href=\"https://kevquirk.com/metro-2033\">https://kevquirk.com/metro-2033</a>\n",
				"date_published": "2023-09-12T10:12:00+01:00",
				"url": "https://qrk.social/2023/09/12/finished-reading-metro.html"
			},
			{
				"id": "http://kq.micro.blog/2023/09/12/metro.html",
				"title": "Metro 2033",
				"content_html": "<!-- raw HTML omitted -->\n<pre><code>    &lt;p style=&quot;font-size:1.3rem;&quot; class=&quot;feed-email-link&quot;&gt;&lt;a href=&quot;mailto:23g@qrk.one?subject=Metro 2033&quot;&gt;Reply to this post by email&lt;/a&gt;&lt;/p&gt;\n</code></pre>\n",
				"content_text": "<div class=\"book\">\n  <figure class=\"floatleft\"><img alt=\"Metro 2033 book cover\" src=\"https://kevquirk.com/media/pages/blog/metro-2033/6ed12050b9-1695904245/metro-2033.webp\" width=\"185px\"></figure>\n  <p>✍️ <b>Written by:</b> Dmitry Glukhovsky<br>\n  🏷 <b>Genre:</b> Sci-fi/fantasy<br>\n  🗓 <b>Published:</b> 09 June 2011<br>\n  📄 <b>Pages:</b> 464<br>\n  🧐 <b>My rating:</b> ★★★☆☆ / 3 stars</p>\n  <div class=\"spacer\"></div>\n  <p>The year is 2033. The world has been reduced to rubble. Humanity is nearly extinct. The half-destroyed cities have become uninhabitable through radiation. Beyond their boundaries, they say, lie endless burned-out deserts and the remains of splintered forests. Survivors still remember the past greatness of humankind. But the last remains of civilisation have already become a distant memory, the stuff of myth and legend.<br>\n<br>\nMore than 20 years have passed since the last plane took off from the earth. Rusted railways lead into emptiness. The ether is void and the airwaves echo to a soulless howling where previously the frequencies were full of news from Tokyo, New York, Buenos Aires. Man has handed over stewardship of the earth to new life-forms. Mutated by radiation, they are better adapted to the new world. Man's time is over.<br>\n<br>\nA few score thousand survivors live on, not knowing whether they are the only ones left on earth. They live in the Moscow Metro - the biggest air-raid shelter ever built. It is humanity's last refuge. Stations have become mini-statelets, their people uniting around ideas, religions, water-filters - or the simple need to repulse an enemy incursion. It is a world without a tomorrow, with no room for dreams, plans, hopes. Feelings have given way to instinct - the most important of which is survival. Survival at any price. VDNKh is the northernmost inhabited station on its line. It was one of the Metro's best stations and still remains secure. But now a new and terrible threat has appeared.<br>\n<br>\nArtyom, a young man living in VDNKh, is given the task of penetrating to the heart of the Metro, to the legendary Polis, to alert everyone to the awful danger and to get help. He holds the future of his native station in his hands, the whole Metro - and maybe the whole of humanity.</p>\n</div>\n<p><a class=\"button\" href=\"https://amzn.to/3RgqEG2\"> Buy on Amazon</a> &nbsp;&nbsp;&nbsp;&nbsp; <a class=\"button\" href=\"https://www.kobo.com/gb/en/ebook/metro-2033-1\">Buy on Kobo</a></p>\n<p>I really enjoyed <em>Metro 2033</em>; the whole premise of people living in the Moscow metro because of some kind of nuclear war is a really interesting concept. I particularly like how the various metro stations are described throughout the book; I've since researched the Moscow metro stations online and <a href=\"https://www.rbth.com/arts/328682-moscow-metro-most-beautiful-stations\">they're really cool</a>!</p>\n<p>This first book spends most of its time setting the scene and cryptically alluding to what happened in the past. It's frustrating that the story is unravelling so slowly, but that suspense is also what pulled me in and made the story enjoyable.</p>\n<p>By the end of the first book, you don't find much out about what happened in the past, but things are starting to develop and the book ends with a bit of a twist that made me jump straight to the 2nd book of this 3-part series.</p>\n<p>Apparently the story is based on a computer game. I don't really play computer games, so I have no idea. Well worth a read though.</p>\n\n        <p style=\"font-size:1.3rem;\" class=\"feed-email-link\"><a href=\"mailto:23g@qrk.one?subject=Metro 2033\">Reply to this post by email</a></p>\n",
				"date_published": "2023-09-12T01:00:00+01:00",
				"url": "https://qrk.social/2023/09/12/metro.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/09/09/the-next-step.html",
				
				"content_html": "<p>The next step in developing our smallholding is to get some chickens. The coop is built and we picked up our 6 little feathered friends recently.<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/clucking-good-fun\">https://kevquirk.com/clucking-good-fun</a><!-- raw HTML omitted --></p>\n",
				"content_text": "The next step in developing our smallholding is to get some chickens. The coop is built and we picked up our 6 little feathered friends recently.   \r\n                <br><a href=\"https://kevquirk.com/clucking-good-fun\">https://kevquirk.com/clucking-good-fun</a>\n",
				"date_published": "2023-09-09T13:26:00+01:00",
				"url": "https://qrk.social/2023/09/09/the-next-step.html"
			},
			{
				"id": "http://kq.micro.blog/2023/09/09/clucking-good-fun.html",
				"title": "Clucking Good Fun 🐔",
				"content_html": "<!-- raw HTML omitted -->\n<pre><code>    &lt;p style=&quot;font-size:1.3rem;&quot; class=&quot;feed-email-link&quot;&gt;&lt;a href=&quot;mailto:23g@qrk.one?subject=Clucking Good Fun 🐔&quot;&gt;Reply to this post by email&lt;/a&gt;&lt;/p&gt;\n</code></pre>\n",
				"content_text": "<p class=\"tldr\">The next step in developing our smallholding is to get some chickens. The coop is built and we picked up our 6 little feathered friends recently.</p>\n<p>My wife has wanted chickens for as long as I can remember, but we've never had the space to do it; when we moved here, we said that chickens would most definitely be on the horizon.</p>\n<p>Now they're here.</p>\n<p>It was my wife's birthday recently, and knowing her better than any other human on planet earth, I knew she'd want a chicken coop for it. So I started researching coops and decided on what seemed to be a fairly good one that's big enough for 12 chickens.</p>\n<p>I just had to build the thing...</p>\n<figure><img alt=\"\" loading=\"lazy\" src=\"https://kevquirk.com/media/pages/blog/clucking-good-fun/6feda15797-1695904245/coop-build-01.webp\"></figure>\n<p>My wife and I headed off to field and started laying the parts of the coop out. Unfortunately, she had to take one of our sons to an appointment, so I was left to fend for myself. I got it done though.</p>\n<figure><img alt=\"\" loading=\"lazy\" src=\"https://kevquirk.com/media/pages/blog/clucking-good-fun/f735a743f8-1695904245/coop-build-02.webp\"></figure>\n<p>After a couple hours with some basic tools, and only a few swear words, the coop was ready...</p>\n<figure><img alt=\"\" loading=\"lazy\" src=\"https://kevquirk.com/media/pages/blog/clucking-good-fun/777e5fe71c-1695904245/coop-build-03.webp\"></figure>\n<h2>Getting chickens</h2>\n<p>My wife wanted ex-battery hens, but unfortunately we couldn't find any that were available in our local area. So we contacted a local chicken farmer and found out that the had some really nice looking hybrids for sale that were just about at POL (point of lay).</p>\n<p class=\"notice\">It's worth noting here that the chickens will be for eggs only, they're not for meat. We deliberately went for a breed that enjoy being handled by people, so we can have them as pets and enjoy them as much as possible.</p>\n<p>Yesterday my wife went and picked up our 6 chickens, and they're lovely. They were mostly timid at first, that is except for 1 chicken we have called Flo. She's <em>definitely</em> chief among the chicks and was immediately out surveying the coop.</p>\n<p>Even sticking a camera in her face didn't bother her...</p>\n<figure><img alt=\"\" loading=\"lazy\" src=\"https://kevquirk.com/media/pages/blog/clucking-good-fun/45c8d5feb6-1695904245/flo-closeup.webp\"></figure>\n<p>The first 24 hours with the chickens has gone as well as we'd have hoped. They went to bed fine last night and seem to generally be settling in.</p>\n<figure><img alt=\"\" loading=\"lazy\" src=\"https://kevquirk.com/media/pages/blog/clucking-good-fun/5b36bd0632-1695904245/chickens-going-to-bed.webp\"><figcaption>Off to bed...</figcaption></figure>\n<p>Now they're more settled and seem content in the coop, we will likely open the door today, maybe tomorrow, and let them start exploring their new field.</p>\n<figure><img alt=\"\" loading=\"lazy\" src=\"https://kevquirk.com/media/pages/blog/clucking-good-fun/06ec2cba0b-1695904245/chickens-day1.webp\"><figcaption>Our chickens, with Flo up front</figcaption></figure>\n<p>I love that our little life down here is starting to come together. My wife is still trying to convince me to get 2 Shetland ponies for the big field, following <a href=\"/mower-failure\">my epic failure when trying to mow it</a>. I'm not too sure about that yet though.</p>\n<p>For now, I'd like to concentrate on all the animals we have, as well as starting to establish our vegetable patch.</p>\n<p>One step at a time...</p>\n\n        <p style=\"font-size:1.3rem;\" class=\"feed-email-link\"><a href=\"mailto:23g@qrk.one?subject=Clucking Good Fun 🐔\">Reply to this post by email</a></p>\n",
				"date_published": "2023-09-09T01:00:00+01:00",
				"url": "https://qrk.social/2023/09/09/clucking-good-fun.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/09/06/went-for-a.html",
				
				"content_html": "<p>Went for a walk during my lunch, it’s around 27c today. To say that I’m sweaty would be an understatement!</p>\n<p>Only an entire afternoon in the office to go… 😳</p>\n",
				"content_text": "Went for a walk during my lunch, it’s around 27c today. To say that I’m sweaty would be an understatement!\n\nOnly an entire afternoon in the office to go… 😳\n",
				"date_published": "2023-09-06T12:55:57+01:00",
				"url": "https://qrk.social/2023/09/06/went-for-a.html"
			},
			{
				"id": "http://kq.micro.blog/2023/09/05/day-of-the.html",
				
				"content_html": "<p>Day 5 of the photoblogging challenge is <strong>Forest</strong> and of course, my entry features the dogs. 😂</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Day 5 of the photoblogging challenge is **Forest** and of course, my entry features the dogs. 😂\n\n<img src=\"uploads/2023/2cf5fffd99.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-09-05T19:33:13+01:00",
				"url": "https://qrk.social/2023/09/05/day-of-the.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/09/04/since-the-last.html",
				
				"content_html": "<p>Since the last post, I&rsquo;ve had a lot of interest in the mailing list idea, so I&rsquo;ve set one up.<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/fat-boy-mailing-list\">https://kevquirk.com/fat-boy-mailing-list</a><!-- raw HTML omitted --></p>\n",
				"content_text": "Since the last post, I've had a lot of interest in the mailing list idea, so I've set one up.   \r\n                <br><a href=\"https://kevquirk.com/fat-boy-mailing-list\">https://kevquirk.com/fat-boy-mailing-list</a>\n",
				"date_published": "2023-09-04T11:50:00+01:00",
				"url": "https://qrk.social/2023/09/04/since-the-last.html"
			},
			{
				"id": "http://kq.micro.blog/2023/09/04/for-day-of.html",
				
				"content_html": "<p>For day 4 of the challenge, here is my <strong>orange</strong> dog.</p>\n<p>(Yes, I am going to try and make the entire month about my dogs 😂)</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "For day 4 of the challenge, here is my **orange** dog.\n\n(Yes, I am going to try and make the entire month about my dogs 😂)\n\n<img src=\"uploads/2023/image.png\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-09-04T07:40:29+01:00",
				"url": "https://qrk.social/2023/09/04/for-day-of.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/09/04/fat-boy-mailing.html",
				"title": "Fat Boy Mailing List",
				"content_html": "<!-- raw HTML omitted -->\n<pre><code>    &lt;p style=&quot;font-size:1.3rem;&quot; class=&quot;feed-email-link&quot;&gt;&lt;a href=&quot;mailto:23g@qrk.one?subject=Fat Boy Mailing List&quot;&gt;Reply to this post by email&lt;/a&gt;&lt;/p&gt;\n</code></pre>\n",
				"content_text": "<p class=\"tldr\">\nSince the <a href=\"https://kevquirk.com/lets-be-accountable-together\">last post</a>, I've had a lot of interest in the mailing list idea, so I've set one up.\n</p>\n<p>Just a quick post to let you all know that I've setup a mailing list for the weight loss thing. Since my last post, there's been a lot of interest from people to join in.</p>\n<p>If you're interested in joining, you can subscribe in one of two ways:</p>\n<p><strong>Option 1 -</strong>  Send a <strong>blank</strong> email to <a href=\"mailto:sympa@framagroupes.org\">sympa@framagroupes.org</a> with the following subject line (replace <code>Name</code> with your actual name):</p>\n<p><code>subscribe accountable_together Name</code></p>\n<p><strong>Option 2 -</strong>  Visit <a href=\"https://framagroupes.org/sympa/info/accountable_together\">this link</a> and click on the Subscribe button from the left-hand sidebar.</p>\n<p><strong>Quick note on privacy</strong> - There are no public archives, so it's private to members only. Also, any emails you send to the mailing list will be sent to everyone else from the mailing list address, so your email won't be exposed.</p>\n<p>Hope to see you on the mailing list!</p>\n\n        <p style=\"font-size:1.3rem;\" class=\"feed-email-link\"><a href=\"mailto:23g@qrk.one?subject=Fat Boy Mailing List\">Reply to this post by email</a></p>\n",
				"date_published": "2023-09-04T01:00:00+01:00",
				"url": "https://qrk.social/2023/09/04/fat-boy-mailing.html"
			},
			{
				"id": "http://kq.micro.blog/2023/09/03/mb-challenge-day.html",
				
				"content_html": "<p>MB challenge day 3: My dogs are very <strong>precious</strong> to me. So much so that my wife thinks I love them more than the kids.</p>\n<p>No comment… 😂</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "MB challenge day 3: My dogs are very **precious** to me. So much so that my wife thinks I love them more than the kids.\n\nNo comment… 😂\n\n<img src=\"uploads/2023/225f368ced.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-09-03T08:55:31+01:00",
				"url": "https://qrk.social/2023/09/03/mb-challenge-day.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/09/02/for-day-of.html",
				
				"content_html": "<p>For day 2 of the photo blogging challenge, I’ve been trying to wade through this <strong>buildup</strong> of grass. 🤦‍♂️</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "For day 2 of the photo blogging challenge, I’ve been trying to wade through this **buildup** of grass. 🤦‍♂️\n\n<img src=\"uploads/2023/fe86c3b2e0.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-09-02T09:52:32+01:00",
				"url": "https://qrk.social/2023/09/02/for-day-of.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/09/02/little-bit-late.html",
				
				"content_html": "<p>Little bit late, but day 1 of the Micro.blog photo blogging challenge is <strong>Abstract</strong></p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Little bit late, but day 1 of the Micro.blog photo blogging challenge is **Abstract**\n\n<img src=\"uploads/2023/13e7001fa8.jpg\" width=\"450\" height=\"600\" alt=\"\">\n",
				"date_published": "2023-09-02T09:46:56+01:00",
				"url": "https://qrk.social/2023/09/02/little-bit-late.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/09/01/so-many-people.html",
				
				"content_html": "<p>So many people have reached out with messages of support following my &ldquo;Fat Boy&rdquo; post. I&rsquo;m thinking maybe we should start a little mailing list?<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/lets-be-accountable-together\">https://kevquirk.com/lets-be-accountable-together</a><!-- raw HTML omitted --></p>\n",
				"content_text": "So many people have reached out with messages of support following my \"Fat Boy\" post. I'm thinking maybe we should start a little mailing list?   \r\n                <br><a href=\"https://kevquirk.com/lets-be-accountable-together\">https://kevquirk.com/lets-be-accountable-together</a>\n",
				"date_published": "2023-09-01T15:52:00+01:00",
				"url": "https://qrk.social/2023/09/01/so-many-people.html"
			},
			{
				"id": "http://kq.micro.blog/2023/09/01/lets-be-accountable.html",
				"title": "Let\u0026#039;s Be Accountable Together",
				"content_html": "<!-- raw HTML omitted -->\n<pre><code>    &lt;p style=&quot;font-size:1.3rem;&quot; class=&quot;feed-email-link&quot;&gt;&lt;a href=&quot;mailto:23g@qrk.one?subject=Let's Be Accountable Together&quot;&gt;Reply to this post by email&lt;/a&gt;&lt;/p&gt;\n</code></pre>\n",
				"content_text": "<p class=\"tldr\">\nSo many people have reached out with messages of support following my \"Fat Boy\" post. I'm thinking maybe we should start a little mailing list?\n</p>\n<p>Since I wrote the <a href=\"/fat-boy-at-40\">Fat Boy at 40</a> post a few days ago, <em>so many</em> people have reached out to offer their stories, advice and support.</p>\n<p>It's been overwhelming how many people have emailed, so thanks to everyone that did.</p>\n<p>Anyway, a few of those people are going through similar processes as myself, which got me to thinking...</p>\n<p><strong>What about setting up a little mailing list that we can all use to share ideas, spur each other on, and/or hold each other accountable.</strong></p>\n<p>If we do it, I'd like to keep it simple and use email, because everyone has an email address and it works well. I've never managed a mailing list though, so I'm open to advice/ideas.</p>\n<p>I dunno, might be a stupid idea, but if you think it could be of use, get in touch using the button below.</p>\n\n        <p style=\"font-size:1.3rem;\" class=\"feed-email-link\"><a href=\"mailto:23g@qrk.one?subject=Let's Be Accountable Together\">Reply to this post by email</a></p>\n",
				"date_published": "2023-09-01T01:00:00+01:00",
				"url": "https://qrk.social/2023/09/01/lets-be-accountable.html"
			},
			{
				"id": "http://kq.micro.blog/2023/08/29/i-recently-turned.html",
				
				"content_html": "<p>I recently turned 39 and I&rsquo;m vowing to NOT be a fat boy by the time I turn 40.<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/fat-boy-at-40\">https://kevquirk.com/fat-boy-at-40</a><!-- raw HTML omitted --></p>\n",
				"content_text": "I recently turned 39 and I'm vowing to NOT be a fat boy by the time I turn 40.   \r\n                <br><a href=\"https://kevquirk.com/fat-boy-at-40\">https://kevquirk.com/fat-boy-at-40</a>\n",
				"date_published": "2023-08-29T17:42:00+01:00",
				"url": "https://qrk.social/2023/08/29/i-recently-turned.html"
			},
			{
				"id": "http://kq.micro.blog/2023/08/29/fat-boy-at.html",
				"title": "Fat Boy at 40?",
				"content_html": "<!-- raw HTML omitted -->\n<pre><code>    &lt;p style=&quot;font-size:1.3rem;&quot; class=&quot;feed-email-link&quot;&gt;&lt;a href=&quot;mailto:23g@qrk.one?subject=Fat Boy at 40?&quot;&gt;Reply to this post by email&lt;/a&gt;&lt;/p&gt;\n</code></pre>\n",
				"content_text": "<p class=\"tldr\">\nI recently turned 39 and I'm vowing to NOT be a fat boy by the time I turn 40.\n</p>\n<p>As of this morning (29 Aug 2023) I weigh 110.9kg (244lbs) and I'm 190cm (6' 3\") tall. According to the <a href=\"https://www.nhs.uk/live-well/healthy-weight/bmi-calculator/\">NHS' BMI calculator</a>, this gives me a BMI of 30.7.</p>\n<p><strong>In other words, I'm obese, people.</strong></p>\n<p class=\"notice\">\nI know BMI is a pretty poor indicator of health, but it's an indicator nevertheless, so I'll be using it as *one data point*. What's far more important is how I feel at the end of this process.\n</p>\n<p>The NHS recommend that I should lose 5.6kg (12.3lbs) in order to get my weight into a more healthy zone. That's actually better than I thought, but I'd like to do better than that before I'm 40.</p>\n<p><strong>I want to get below 100kg (220lbs).</strong></p>\n<h2>Why lose weight?</h2>\n<p>I thought the answer to this question was obvious, but just in case, I'll spell it out:</p>\n<ul>\n<li>My blood pressure is starting to creep up - I need to reduce that</li>\n<li>Joints are starting to become painful</li>\n<li>My back is in shit state because it's lugging a rather large belly around all the time</li>\n<li>I sleep like shit</li>\n<li><strong>I want to be healthier</strong></li>\n</ul>\n<h2>How will I do this?</h2>\n<p>I <em>could</em> go on a crash diet on lose 10.9kg (24lbs) over the course of a couple months. But that's probably worse for me in the long run, as I'll basically be starving myself and when I come off the diet, I'll go straight back to all my bad habits.</p>\n<p>Instead, I want to make a number of life changes that will hopefully add up to a larger change, meaning I lose weight. I think giving myself a year to do this is realistic.</p>\n<p>This isn't a diet. It's a lifestyle change, folks.</p>\n<p>Ultimately it all boils down to eating less and moving more. My diet is pretty good already, but I tend to graze on snacks in the evening once the kids go to bed. That will have to stop.</p>\n<p>I walk the dogs a lot, and I'm generally active looking after <a href=\"/tag:HomeLife\">our 2.5 acre smallholding</a>, but I still need to exercise more. I'm too heavy for running at the moment - it fucks my knees - so I'll be cycling again, as well as doing small weights.</p>\n<p>I was a PTI (Physical Training Instructor) when I was in the Army, so I actually have a lot of knowledge about all this - I just need to implement it.</p>\n<p>I'll never have a six pack again. I'll never run a 10k in 40 minutes again. But if I can get to a point where I'm not <em>clinically obese</em>, where my belt buckle doesn't rub on my belly - making it sore (TMI?) - and where I'm generally fitter and healthier, I'll be a happy camper.</p>\n<p>I'm planning on tracking all this, because, you know, I'm a nerd and I love data. I'm going to try and write regular (monthly?) updates here, which will include:</p>\n<ul>\n<li>General updates - what's been good, what's bad</li>\n<li>My weight</li>\n<li>My BMI</li>\n<li>My blood pressure</li>\n</ul>\n<p>If you've gone through a similar journey, I'd love to hear about your experiences, and any advice you might have.</p>\n<p>Wish me luck.</p>\n\n        <p style=\"font-size:1.3rem;\" class=\"feed-email-link\"><a href=\"mailto:23g@qrk.one?subject=Fat Boy at 40?\">Reply to this post by email</a></p>\n",
				"date_published": "2023-08-29T01:00:00+01:00",
				"url": "https://qrk.social/2023/08/29/fat-boy-at.html"
			},
			{
				"id": "http://kq.micro.blog/2023/08/26/youngest-sons-birthday.html",
				
				"content_html": "<p>Youngest son’s birthday tomorrow. He really wants a trampoline, but I *<strong>HATE</strong> them. Guess who won that battle, and guess who’s been building a trampoline this evening…🤦‍♂️</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Youngest son’s birthday tomorrow. He really wants a trampoline, but I ***HATE** them. Guess who won that battle, and guess who’s been building a trampoline this evening…🤦‍♂️\n\n<img src=\"uploads/2023/c5c68ba185.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-08-26T22:14:10+01:00",
				"url": "https://qrk.social/2023/08/26/youngest-sons-birthday.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/08/22/i-decided-to.html",
				
				"content_html": "<p>I decided to mow the larger of our 2 fields yesterday, but our plucky little mower couldn&rsquo;t handle it.<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/mower-failure\">https://kevquirk.com/mower-failure</a><!-- raw HTML omitted --></p>\n",
				"content_text": "I decided to mow the larger of our 2 fields yesterday, but our plucky little mower couldn't handle it.   \r\n                <br><a href=\"https://kevquirk.com/mower-failure\">https://kevquirk.com/mower-failure</a>\n",
				"date_published": "2023-08-22T17:03:00+01:00",
				"url": "https://qrk.social/2023/08/22/i-decided-to.html"
			},
			{
				"id": "http://kq.micro.blog/2023/08/22/mower-failure.html",
				"title": "Mower Failure",
				"content_html": "<!-- raw HTML omitted -->\n<pre><code>    &lt;p style=&quot;font-size:1.3rem;&quot; class=&quot;feed-email-link&quot;&gt;&lt;a href=&quot;mailto:23g@qrk.one?subject=Mower Failure&quot;&gt;Reply to this post by email&lt;/a&gt;&lt;/p&gt;\n</code></pre>\n",
				"content_text": "<p class=\"tldr\">\nI decided to mow the larger of our 2 fields yesterday, but our plucky little mower couldn't handle it.\n</p>\n<p>Our 2.5 acre homestead is split into 3 main sections; the \"home\" section, which contains our house, the gardens and outbuildings. Then we have fields 1 and 2. Here's an arial shot of our plot to give you a better idea:</p>\n<figure><img alt=\"A map of our plot at home\" loading=\"lazy\" src=\"https://kevquirk.com/media/pages/blog/mower-failure/4a904f4ea2-1695904245/home-plotted.webp\"><figcaption>Blue is the \"home\" section, then fields 1 & 2</figcaption></figure>\n<p>As you can see, field 2 is easily double the size of field 1, but we don't really use that field. Mainly because we don't know what to do with it yet and we can't see it from our house. So you know, outta sight, outta mind.</p>\n<p>We recently had <a href=\"/cows\">cows put on field 2</a> to get the grass back under control, as it was chest height (and I'm 6' 3\"), but it's now been a few weeks since our bovine friends left us, so it was time for me to try and tackle field 2 with our mower.</p>\n<p>I regularly mow field 1, and it's usually a very relaxing and satisfying experience now that the grass is under control:</p>\n<figure><img alt=\"Mowing one of our fields\" loading=\"lazy\" src=\"https://kevquirk.com/media/pages/blog/mower-failure/74f303af41-1695904245/mowing-field-1.webp\"></figure>\n<p>But field 2 is a different beast entirely. It has a large hill right across the middle of it, and it's huge. But I decided to give it a go anyway, thinking the grass wasn't <em>that</em> long.</p>\n<p>Mowing field 1 usually takes me about an hour, so I assumed field 2 would take around 2 - 2.5 hours...</p>\n<p>After 4 hours I was still going.</p>\n<h2>The problem</h2>\n<p>At the bottom of field 2 is a fairly large, flat plane. The grass didn't look too long down there, so thinking that would be the easy bit, I decided to tackle the hilly part of the field first.</p>\n<p>By the time I got down there, I was knackered, and a bit pissed off, as mowing a very steep hill on a little mower is no fun. Even 4x4 mower, like ours.</p>\n<p>Then, to add insult to injury, the grass on the plane was <em>really</em> dense, so the mower really struggled. It actually struggled so much that the thickness of the grass stalled the 650cc motor more than once.</p>\n<p>But I soldiered on and slowly chipped away at it. I literally had 2 small runs of grass left to do. I thought I was victorious, dear reader! I had conquered field 2. Life was good.</p>\n<p>Then there was a bang and smoke started billowing from our plucky little Husqvarna. I turned the engine off and had a look - the poor girl had snapped a belt. We were so close! 😭</p>\n<figure><img alt=\"My mower, dead in a large field\" loading=\"lazy\" src=\"https://kevquirk.com/media/pages/blog/mower-failure/149e747ad9-1695904245/dead-mower-field-2.webp\"><figcaption>My poor little mower, dead in field 2</figcaption></figure>\n<figure><img alt=\"A close up of my dead mower in a large field\" loading=\"lazy\" src=\"https://kevquirk.com/media/pages/blog/mower-failure/dd473b5bf8-1695904245/dead-mower-field-2-close-up.webp\"></figure>\n<p>As you can see, this is a pretty large field and I had just 2 strips to go!</p>\n<p class=\"notice\">\nI didn't do the very top section of the field as there's a natural spring there, so it gets very boggy - we're going to turn that into a pond soon.\n</p>\n<h2>What's next?</h2>\n<p>Luckily the problem wasn't terminal and replacing the belt should be very easy. Once I've repaired the belt, I'll be back in field 2 to finish off those 2 strips. Then I'll head back and do the rest of it all over again, except on a shorter cut length.</p>\n<p>Once all the long grass mulches down and I have it under control, I <em>should</em> be able to mow the thing in a couple of hours. I think...</p>\n<p>If that doesn't work, we will bring our plans forward to fence it off and put livestock on it permanently to keep it under control.</p>\n<p>Maybe a few sheep? Who knows. 🤷‍♂️</p>\n\n        <p style=\"font-size:1.3rem;\" class=\"feed-email-link\"><a href=\"mailto:23g@qrk.one?subject=Mower Failure\">Reply to this post by email</a></p>\n",
				"date_published": "2023-08-22T01:00:00+01:00",
				"url": "https://qrk.social/2023/08/22/mower-failure.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/08/19/wifes-th-birthday.html",
				
				"content_html": "<p>Wife’s 40th birthday today, and we’re having a party. So I’ve been running around all morning and thus wearing my Mudman G-SHOCK.</p>\n<p>However, now I’m ready for the party, today’s #Wristcheck is this exquisite Baltany field watch. 👌</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Wife’s 40th birthday today, and we’re having a party. So I’ve been running around all morning and thus wearing my Mudman G-SHOCK.\n\nHowever, now I’m ready for the party, today’s #Wristcheck is this exquisite Baltany field watch. 👌\n\n<img src=\"uploads/2023/dd46887898.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-08-19T13:21:30+01:00",
				"url": "https://qrk.social/2023/08/19/wifes-th-birthday.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/08/18/this-took-a.html",
				
				"content_html": "<p>This took a VERY long time, but I finally finished putting together my entire watch collection on my site.</p>\n<p><a href=\"https://kevquirk.com/watches\">kevquirk.com/watches</a></p>\n",
				"content_text": "This took a VERY long time, but I finally finished putting together my entire watch collection on my site.\r\n\r\n[kevquirk.com/watches](https://kevquirk.com/watches)\r\n",
				"date_published": "2023-08-18T18:08:18+01:00",
				"url": "https://qrk.social/2023/08/18/this-took-a.html",
				"tags": ["Watches"]
			},
			{
				"id": "http://kq.micro.blog/2023/08/17/gah-i-hate.html",
				
				"content_html": "<p>Gah. I <strong>HATE</strong> that Micro.blog only mentions a single person when replying to multiple people. It seems like such a stupid approach.</p>\n<p>Conversations, especially in an open forum like this, often involve multiple parties.</p>\n",
				"content_text": "Gah. I **HATE** that Micro.blog only mentions a single person when replying to multiple people. It seems like such a stupid approach.\n\nConversations, especially in an open forum like this, often involve multiple parties.\n",
				"date_published": "2023-08-17T09:37:52+01:00",
				"url": "https://qrk.social/2023/08/17/gah-i-hate.html"
			},
			{
				"id": "http://kq.micro.blog/2023/08/16/wife-and-i.html",
				
				"content_html": "<p>Wife and I finished watching Schitts Creek this evening. Absolutely loved it - well worth a watch if you want some lighthearted humour.</p>\n<p><a href=\"https://www.imdb.com/title/tt3526078\">www.imdb.com/title/tt3&hellip;</a></p>\n",
				"content_text": "Wife and I finished watching Schitts Creek this evening. Absolutely loved it - well worth a watch if you want some lighthearted humour.\n\n[www.imdb.com/title/tt3...](https://www.imdb.com/title/tt3526078)\n",
				"date_published": "2023-08-16T23:26:51+01:00",
				"url": "https://qrk.social/2023/08/16/wife-and-i.html"
			},
			{
				"id": "http://kq.micro.blog/2023/08/15/been-working-on.html",
				
				"content_html": "<p>Been working on a page on my website for my watch collection. Goddam I have a lot of watches. 🥵⌚️</p>\n",
				"content_text": "Been working on a page on my website for my watch collection. Goddam I have a lot of watches. 🥵⌚️\n",
				"date_published": "2023-08-15T19:39:48+01:00",
				"url": "https://qrk.social/2023/08/15/been-working-on.html",
				"tags": ["Watches"]
			},
			{
				"id": "http://kq.micro.blog/2023/08/11/took-the-day.html",
				
				"content_html": "<p>Took the day off work. Kids are in holiday club, wife is off work too. Weather supposed to be lovely, so we planned a nice day together, just the 2 of us.</p>\n<p>Youngest woke up with a vomiting bug this morning. Typical. 😂</p>\n",
				"content_text": "Took the day off work. Kids are in holiday club, wife is off work too. Weather supposed to be lovely, so we planned a nice day together, just the 2 of us.\n\nYoungest woke up with a vomiting bug this morning. Typical. 😂\n",
				"date_published": "2023-08-11T09:43:17+01:00",
				"url": "https://qrk.social/2023/08/11/took-the-day.html"
			},
			{
				"id": "http://kq.micro.blog/2023/08/10/best-day-ive.html",
				
				"content_html": "<p>Best day I’ve taken off work for a while… 🏍️</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Best day I’ve taken off work for a while… 🏍️\n\n<img src=\"uploads/2023/0ee7d6b040.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-08-10T17:08:17+01:00",
				"url": "https://qrk.social/2023/08/10/best-day-ive.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/08/07/i-can-certainly.html",
				
				"content_html": "<p>I can certainly think of worse places to walk the dogs&hellip;</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "I can certainly think of worse places to walk the dogs...\n\n<img src=\"uploads/2023/img-0698.jpeg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-08-07T17:18:04+01:00",
				"url": "https://qrk.social/2023/08/07/i-can-certainly.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/08/07/and-this-is.html",
				
				"content_html": "<p>&hellip;and this is why I don&rsquo;t post pictures (or details) of my kids on social media. Very powerful video.</p>\n<p><a href=\"https://www.youtube.com/watch?v=F4WZ_k0vUDM\">www.youtube.com/watch</a></p>\n",
				"content_text": "...and this is why I don't post pictures (or details) of my kids on social media. Very powerful video.\r\n\r\n[www.youtube.com/watch](https://www.youtube.com/watch?v=F4WZ_k0vUDM)\r\n",
				"date_published": "2023-08-07T14:26:22+01:00",
				"url": "https://qrk.social/2023/08/07/and-this-is.html"
			},
			{
				"id": "http://kq.micro.blog/2023/08/03/rhythm-of-war.html",
				
				"content_html": "<p>Rhythm of War - the 4th book in Brandon Sanderson&rsquo;s Stormlight Archive<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/rhythm-of-war\">https://kevquirk.com/rhythm-of-war</a><!-- raw HTML omitted --></p>\n",
				"content_text": "Rhythm of War - the 4th book in Brandon Sanderson's Stormlight Archive   \n                <br><a href=\"https://kevquirk.com/rhythm-of-war\">https://kevquirk.com/rhythm-of-war</a>\n",
				"date_published": "2023-08-03T18:10:00+01:00",
				"url": "https://qrk.social/2023/08/03/rhythm-of-war.html",
				"tags": ["Books"]
			},
			{
				"id": "http://kq.micro.blog/2023/08/03/010000.html",
				"title": "Rhythm of War",
				"content_html": "<!-- raw HTML omitted -->\n<pre><code>    &lt;p style=&quot;font-size:1.3rem;&quot; class=&quot;feed-email-link&quot;&gt;&lt;a href=&quot;mailto:23g@qrk.one?subject=Rhythm of War&quot;&gt;Reply to this post by email&lt;/a&gt;&lt;/p&gt;\n</code></pre>\n",
				"content_text": "<div class=\"book\">\n  <figure class=\"floatleft\"><img alt=\"Rhythm of War book cover\" src=\"https://kevquirk.com/media/pages/blog/rhythm-of-war/44a2f9e3dd-1695904245/rhythm-of-war-cover.webp\"></figure>\n  <p>✍️ <b>Written by:</b> Brandon Sanderson<br>\n  🏷 <b>Genre:</b> Sci-fi / fantasy<br>\n  🗓 <b>Published:</b> 17 Nov 2020<br>\n  📄 <b>Pages:</b> 1,232<br>\n  🧐 <b>My rating:</b> ★★★★☆ / 4 stars</p>\n  <div class=\"spacer\"></div>\n  <p>After forming a coalition of human resistance against the enemy invasion, Dalinar Kholin and his Knights Radiant have spent a year fighting a protracted, brutal war. Neither side has gained an advantage, and the threat of a betrayal by Dalinar's crafty ally Taravangian looms over every strategic move.<br>\n<br>\nNow, as new technological discoveries by Navani Kholin's scholars begin to change the face of the war, the enemy prepares a bold and dangerous operation. The arms race that follows will challenge the very core of the Radiant ideals, and potentially reveal the secrets of the ancient tower that was once the heart of their strength.<br>\n<br>\nAt the same time that Kaladin Stormblessed must come to grips with his changing role within the Knights Radiant, his Windrunners face their own problem: As more and more deadly enemy Fused awaken to wage war, no more honorspren are willing to bond with humans to increase the number of Radiants. Adolin and Shallan must lead the coalition’s envoy to the honorspren stronghold of Lasting Integrity and either convince the spren to join the cause against the evil god Odium, or personally face the storm of failure.</p>\n</div>\n<p><a class=\"button\" href=\"https://amzn.to/45wfd19\"> Buy on Amazon</a> &nbsp;&nbsp;&nbsp;&nbsp; <a class=\"button\" href=\"https://www.kobo.com/gb/en/ebook/rhythm-of-war-3\">Buy on Kobo</a></p>\n<p>I enjoyed <em>Rhythm of War</em>, but I do feel like it went on a little too long. Maybe it's because I've done these 4 books back-to-back and I'm getting a little tired of the story, but I felt like this one was hard work.</p>\n<p>Enjoyable, but hard work. Throughout the book I thought that Sanderson wasted time developing storylines and characters that he didn't necessarily need to, but toward the end of the book it - in true Sanderson fashion - it all came together and made sense.</p>\n<p>Having said that, I still think it dragged on for longer than necessary. Still though, it was a great read and I'm looking forward to the 5th book coming out. But for now I'm going to enjoy a break from Kaladin and his pals.</p>\n\n        <p style=\"font-size:1.3rem;\" class=\"feed-email-link\"><a href=\"mailto:23g@qrk.one?subject=Rhythm of War\">Reply to this post by email</a></p>\n",
				"date_published": "2023-08-03T01:00:00+01:00",
				"url": "https://qrk.social/2023/08/03/010000.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/08/02/as-coadmin-of.html",
				
				"content_html": "<p>As co-admin of one of the largest tech instances on the Fediverse, it&rsquo;s ironic that I struggle with social platforms so much.<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/running-a-social-platform-as-someone-who-dislikes-them\">https://kevquirk.com/running-a-social-platform-as-someone-who-dislikes-them</a><!-- raw HTML omitted --></p>\n",
				"content_text": "As co-admin of one of the largest tech instances on the Fediverse, it's ironic that I struggle with social platforms so much.   \r\n                <br><a href=\"https://kevquirk.com/running-a-social-platform-as-someone-who-dislikes-them\">https://kevquirk.com/running-a-social-platform-as-someone-who-dislikes-them</a>\n",
				"date_published": "2023-08-02T15:53:00+01:00",
				"url": "https://qrk.social/2023/08/02/as-coadmin-of.html"
			},
			{
				"id": "http://kq.micro.blog/2023/08/02/running-a-social.html",
				"title": "Running a Social Platform as Someone Who Dislikes Them",
				"content_html": "<!-- raw HTML omitted -->\n<pre><code>    &lt;p style=&quot;font-size:1.3rem;&quot; class=&quot;feed-email-link&quot;&gt;&lt;a href=&quot;mailto:23g@qrk.one?subject=Running a Social Platform as Someone Who Dislikes Them&quot;&gt;Reply to this post by email&lt;/a&gt;&lt;/p&gt;\n</code></pre>\n",
				"content_text": "<p class=\"tldr\">\nAs co-admin of one of the largest tech instances on the Fediverse, it's ironic that I struggle with social platforms so much.\n</p>\n<p>After posting my yearning to <a href=\"/bring-back-the-humble-forum\">bring back forums</a>, Basil asked a very astute question <a href=\"https://fosstodon.org/@basil@sarcasm.stream/110779914593831546\">over on Mastodon</a>:</p>\n<figure><img alt=\"A post from Basil on Mastodon\" src=\"https://kevquirk.com/media/pages/blog/running-a-social-platform-as-someone-who-dislikes-them/7fb84b0cbc-1695904245/basil-post-fosstodon.webp\"><figcaption>Screenshot curtesy of <a href=\"https://github.com/raikasdev/mastopoet\">Mastopoet</a></figcaption></figure>\n<p>Basil is right; I do struggle with the irony of running a social platform, yet being increasingly disenfranchised with the whole thing.</p>\n<p>Sometimes is it somewhat of a hassle, but I think that's par for the course for any admin of a large network, like Fosstodon. Having said that, Mike and I made the decision right from the start that we didn't want the burden of SysAdmin to be on us, so we hosted with <a href=\"https://masto.host\">Masto.host</a> from the start.</p>\n<p>That's really helped, as Hugo - the guy who runs Masto.host - has always been brilliant. Having said that, it's still challenging being one of the admins of a platform that's a) <em>really</em> large and going and b) I'm losing faith in.</p>\n<p class=\"notice\">\nTo be clear, I'm <b>not</b> losing faith in Fosstodon in particular, or even Mastodon - I'm losing faith in all social networks.\n</p>\n<p>As I've said before, I have no plans to leave Fosstodon, but I have taken a step back with my social presence. At this point, I work in the background to support Mike and the team, and I enjoy the interactions I have with those I follow, and who follow me. But I don't visit the local timeline - I just stick to my bubble.</p>\n<p>I'm really enjoying the engagement I get as a result of the posts I write here, both via email and on Fosstodon. So there's no plans to change things. I'll just keep to my little echo chamber, happily ignorant of what's going on around the rest of the Fedi.</p>\n<h2>Real life is more important</h2>\n<p>Since moving house last year, real life has taken over completely. I'm less interested in technology and all the related \"<em>stuff</em>\". I suppose it has given me some perspective? Spending a day in the garden, working the land or looking after our animals with the kids, is far more rewarding than any social platform can <em>ever</em> give me.</p>\n<p>So that's where I'm focussing my efforts. I'll always be interested in technology. I'll always enjoy the discourse I have on Fosstodon, but my \"real life\" is far more important to me.</p>\n<p>I'm not sure I've answered Basil's question very well here - this post is rather shit and rambling. I may come back and edit it when I can arrange my thoughts more, but it will do for now.</p>\n\n        <p style=\"font-size:1.3rem;\" class=\"feed-email-link\"><a href=\"mailto:23g@qrk.one?subject=Running a Social Platform as Someone Who Dislikes Them\">Reply to this post by email</a></p>\n",
				"date_published": "2023-08-02T01:00:00+01:00",
				"url": "https://qrk.social/2023/08/02/running-a-social.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/08/01/why-does-crossposting.html",
				
				"content_html": "<p>Why does cross-posting not work when a picture is attached?</p>\n",
				"content_text": "Why does cross-posting not work when a picture is attached?\n",
				"date_published": "2023-08-01T20:23:46+01:00",
				"url": "https://qrk.social/2023/08/01/why-does-crossposting.html"
			},
			{
				"id": "http://kq.micro.blog/2023/08/01/hooman-im-ready.html",
				
				"content_html": "<p>Hooman, I’m ready come up on the sofa now…</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Hooman, I’m ready come up on the sofa now…\n\n<img src=\"uploads/2023/5d97183ff8.jpg\" width=\"450\" height=\"600\" alt=\"\">\n",
				"date_published": "2023-08-01T20:12:43+01:00",
				"url": "https://qrk.social/2023/08/01/hooman-im-ready.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/07/26/social-media-is.html",
				
				"content_html": "<p>Social media is fucking us all up. I&rsquo;d love to go back to the days of forums, where there was no popularity contests, or &ldquo;influencers&rdquo;.<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/bring-back-the-humble-forum\">https://kevquirk.com/bring-back-the-humble-forum</a><!-- raw HTML omitted --></p>\n",
				"content_text": "Social media is fucking us all up. I'd love to go back to the days of forums, where there was no popularity contests, or \"influencers\".   \r\n                <br><a href=\"https://kevquirk.com/bring-back-the-humble-forum\">https://kevquirk.com/bring-back-the-humble-forum</a>\n",
				"date_published": "2023-07-26T10:47:00+01:00",
				"url": "https://qrk.social/2023/07/26/social-media-is.html"
			},
			{
				"id": "http://kq.micro.blog/2023/07/26/bring-back-the.html",
				"title": "Bring Back the Humble Forum",
				"content_html": "<!-- raw HTML omitted -->\n<pre><code>    &lt;p style=&quot;font-size:1.3rem;&quot; class=&quot;feed-email-link&quot;&gt;&lt;a href=&quot;mailto:23g@qrk.one?subject=Bring Back the Humble Forum&quot;&gt;Reply to this post by email&lt;/a&gt;&lt;/p&gt;\n</code></pre>\n",
				"content_text": "<p class=\"tldr\">\nSocial media is fucking us all up. I'd love to go back to the days of forums, where there was no popularity contests, or \"influencers\".\n</p>\n<p>I've been <a href=\"/anti-social-update\">ruminating about my use of social media a lot recently</a> and to be honest, I'm still not that happy with it. I've taken a step back and <a href=\"/how-it-all-connects\">automated social posting</a>, which has really helped. But I do miss the good old days of the humble internet forum.</p>\n<p>One could argue that a forum was the precursor to the social web we have today, but I don't think I agree. You see, most social platforms are a popularity contest - they provoke people to game the system to increase engagement and all that other shit.</p>\n<p>My social networks of choice, <a href=\"https://fosstodon.org/@kev\">Mastodon</a> and <a href=\"https://micro.blog/kq\">Micro.blog</a>, are better than most, but they're still a popularity contest.</p>\n<p>Forums, on the other hand, were just a platform that facilitated the coming together of people with similar interests. There were no followers, no boosting, no influencers and no bullshit. It was lovely.</p>\n<p>For the most part, forum users fell into a couple of buckets - people who wanted to either help others, or people who just wanted to chew the cud about a topic they're interested in.</p>\n<p>Don't get me wrong, forums had some of the same problems that plague the social web today. Namely trolls and idiots, but that's par for the course for any place where a large number of people congregate. My forum experiences were almost exclusively positive.</p>\n<h2>Doom scrolling</h2>\n<p>This just wasn't a thing on the forums of old. New topics would start, they were chronological, and you could dip in and out of the discussions as you saw fit.</p>\n<p>You could spend 5 minutes scanning through the topic titles of your favourite forums, or you could spend hours trawling through all the conversation. There was no algorithm trying to manipulate you; the choice was yours.</p>\n<p>Even the advertising was better as they were usually relevant to the subject of the forum, so were actually useful. Plus, they didn't <a href=\"/how-online-tracking-works\">track you</a>.</p>\n<p>There were 3 forums that I frequented back in the day:</p>\n<ul>\n<li><strong>ARRSE (The Army Rumour Service)</strong> - This forum is <a href=\"https://www.arrse.co.uk/community/\">still going strong today</a> and I really enjoyed it when I was a serving soldier</li>\n<li><strong>MuscleTalk</strong> - I used to enjoy weightlifting and keeping fit, when I did, this forum was invaluable for me. Unfortunately it's become a weird blog thing now</li>\n<li><strong>PinguyOS Forum</strong> - I ran <a href=\"https://distrowatch.com/table.php?distribution=pinguy\">PinguyOS</a> for quite a few years, and I ended up becoming a moderator on their forum. I made a lot of friends during those years, and are some of the times I look back most fondly on the web</li>\n</ul>\n<p>Unfortunately, dear reader, <a href=\"https://thewebisfucked.com\">The Web is Fucked</a>. But that won't stop me wishing for the golden days of the Internet. Yeah, it wasn't perfect, but it was a damned sight better than it is now.</p>\n\n        <p style=\"font-size:1.3rem;\" class=\"feed-email-link\"><a href=\"mailto:23g@qrk.one?subject=Bring Back the Humble Forum\">Reply to this post by email</a></p>\n",
				"date_published": "2023-07-26T01:00:00+01:00",
				"url": "https://qrk.social/2023/07/26/bring-back-the.html"
			},
			{
				"id": "http://kq.micro.blog/2023/07/25/today-i-learned.html",
				
				"content_html": "<p>Today I learned that the Tesla range of cars are named as such so that they spell out the word “sexy”.</p>\n<p>Model S\nModel 3\nModel X\nModel Y</p>\n<p>What an utter fucking man child that man is.</p>\n",
				"content_text": "Today I learned that the Tesla range of cars are named as such so that they spell out the word “sexy”.\n\nModel S\nModel 3\nModel X\nModel Y\n\nWhat an utter fucking man child that man is.\n",
				"date_published": "2023-07-25T19:38:47+01:00",
				"url": "https://qrk.social/2023/07/25/today-i-learned.html"
			},
			{
				"id": "http://kq.micro.blog/2023/07/24/made-some-changes.html",
				
				"content_html": "<p>Made some changes to <a href=\"https://kevquirk.com\">the website</a> over the weekend. Slightly improved header that takes up less vertical space on the page. I never really liked the centralised logo and nav menu.</p>\n<p>I think this works much better, although I might make it a little wider than the main content. 🤷‍♂️</p>\n<!-- raw HTML omitted -->\n<!-- raw HTML omitted -->\n",
				"content_text": "Made some changes to [the website](https://kevquirk.com) over the weekend. Slightly improved header that takes up less vertical space on the page. I never really liked the centralised logo and nav menu.\n\nI think this works much better, although I might make it a little wider than the main content. 🤷‍♂️\n\n<img src=\"uploads/2023/1c707106b3.webp\" width=\"600\" height=\"453\" alt=\"\">\n\n<img src=\"uploads/2023/f120d3cfbe.webp\" width=\"600\" height=\"453\" alt=\"\">\n",
				"date_published": "2023-07-24T14:15:48+01:00",
				"url": "https://qrk.social/2023/07/24/made-some-changes.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/07/20/my-wife-will.html",
				
				"content_html": "<p>My wife will be cutting her hair off for charity today - the charity use the donated hair to make wigs for young cancer survivors and alopecia sufferers.</p>\n<p>If you’re interested in donating, that would be cool and very much appreciated. 👍</p>\n<p><a href=\"https://www.justgiving.com/page/jenny-quirk-1689314091635\">www.justgiving.com/page/jenn&hellip;</a></p>\n",
				"content_text": "My wife will be cutting her hair off for charity today - the charity use the donated hair to make wigs for young cancer survivors and alopecia sufferers.\n\nIf you’re interested in donating, that would be cool and very much appreciated. 👍\n\n[www.justgiving.com/page/jenn...](https://www.justgiving.com/page/jenny-quirk-1689314091635)\n",
				"date_published": "2023-07-20T07:03:56+01:00",
				"url": "https://qrk.social/2023/07/20/my-wife-will.html"
			},
			{
				"id": "http://kq.micro.blog/2023/07/17/i-know-im.html",
				
				"content_html": "<p>I know I&rsquo;m bias, but he&rsquo;s a handsome little thing&hellip;</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "I know I'm bias, but he's a handsome little thing...\n\n<img src=\"uploads/2023/squid.webp\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-07-17T17:00:32+01:00",
				"url": "https://qrk.social/2023/07/17/i-know-im.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/07/17/i-love-my.html",
				
				"content_html": "<p>I love my Crocs. I have 3 pairs, and in this post I&rsquo;m going to convince you that they&rsquo;re the best shoes on earth.<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/fact-crocs-are-the-best-shoes-on-earth\">https://kevquirk.com/fact-crocs-are-the-best-shoes-on-earth</a><!-- raw HTML omitted --></p>\n",
				"content_text": "I love my Crocs. I have 3 pairs, and in this post I'm going to convince you that they're the best shoes on earth.   \r\n                <br><a href=\"https://kevquirk.com/fact-crocs-are-the-best-shoes-on-earth\">https://kevquirk.com/fact-crocs-are-the-best-shoes-on-earth</a>\n",
				"date_published": "2023-07-17T10:27:00+01:00",
				"url": "https://qrk.social/2023/07/17/i-love-my.html"
			},
			{
				"id": "http://kq.micro.blog/2023/07/17/fact-crocs-are.html",
				"title": "Fact: Crocs Are the Best Shoes on Earth",
				"content_html": "<!-- raw HTML omitted -->\n<pre><code>    &lt;p style=&quot;font-size:1.3rem;&quot; class=&quot;feed-email-link&quot;&gt;&lt;a href=&quot;mailto:23g@qrk.one?subject=Fact: Crocs Are the Best Shoes on Earth&quot;&gt;Reply to this post by email&lt;/a&gt;&lt;/p&gt;\n</code></pre>\n",
				"content_text": "<p class=\"tldr\">\nI love my Crocs. I have 3 pairs, and in this post I'm going to convince you that they're the best shoes on earth.\n</p>\n<p>Yes yes yes, I've heard it all before <strong><em>\"the holes in Crocs are where your dignity leaks out.\"</em></strong> But the fact is, they're really bloody comfortable, and good for your feet too, apparently.</p>\n<p>Around 8 years ago, I was really struggling with <a href=\"https://www.nhs.uk/conditions/plantar-fasciitis/\">plantar fasciitis</a>. I'd get up in the morning and could barely walk, it was so painful. So, I went to see the Doc, who recommended I try Crocs. My response was something like:</p>\n<blockquote>\n<p>They're horrible and I'm not an old man</p>\n</blockquote>\n<p>But after thinking about it, and looking at them online, they only cost like £40, so I decided it was worth a punt.</p>\n<p>A day later they arrived, I slipped them on and it was like heaven on earth! They're nice and wide, so your feet have plenty of room to breath and stretch out. They're also <em>so</em> comfortable and they have really good arch support.</p>\n<p>I rarely had them off my feet, and they were quickly worn ragged. So they were demoted to \"my outdoor Crocs\" and I bought another pair for in the house. This second pair also wore out after a few years, so I bought a <em>third</em> pair.</p>\n<p>I now have a pair for in the house, a pair by the back door, and a pair by the side door, both for outside. If I'm in or around the house, you can bet I'll be wearing Crocs.</p>\n<figure><img alt=\"My Crocs\" loading=\"lazy\" src=\"https://kevquirk.com/media/pages/blog/crocs-best-shoes-on-earth/741f077a91-1695904245/crocs.webp\"><figcaption>All the Crocs</figcaption></figure>\n<h2>Then COVID hit</h2>\n<p>Like many people, I was at home a lot more during COVID, so my mum bought me a pair of nice suede slippers for my birthday. Being the dutiful son that I am, I replaced my trusty Crocs with the slippers.</p>\n<p>Because I was at home all the time, my slippers got a lot of wear, and over the course of a few months, I notice the pain in my feet returning. I thought nothing of it and just got on with things, but over the period of 6 months or so, the pain returned to the point it was at before - I could barely walk when I woke up again.</p>\n<p><strong>Then it dawned on me...</strong></p>\n<blockquote>\n<p>Jen, it's my Crocs. I haven't been wearing my Crocs!</p>\n</blockquote>\n<p>...is what I exclaimed to my wife. Her response was something like <em>\"that's nice, dear\"</em>. She's obviously not as invested in Crocs as myself - not unless she's heading into the back garden and steals my outdoor Crocs, of course!</p>\n<p>Anyway, I digress...</p>\n<p>I started wearing my Crocs again, and sure enough, the pain went away once more. Dear reader, Crocs are fucking awesome. They're:</p>\n<ul>\n<li>Cheap (you can get them for like £30 now)</li>\n<li>Hard wearing</li>\n<li>Comfortable</li>\n<li>100% waterproof</li>\n<li>Doctor recommended</li>\n</ul>\n<h2>Seriously, buy some Crocs!</h2>\n<p>I'm considering buying a 4th pair that I can wear outdoors. I don't mean in the garden, I mean like legit outdoor - like to work and shit.</p>\n<p>Sure, I might get some funny looks, but do I care? Nope. They're so damned comfy, and they take all the pain away from my feet. So I'd be silly not to, right...<em>RIGHT</em>?!</p>\n<p>If you haven't tried Crocs, please do. Especially if you have any kind of problems with your feet. They're bloody brilliant. I still can't wear them without socks though - the rubber rubs on my toe nails and I <em>hate</em> it.</p>\n<p>If I'm going sockless, there's only 1 sandal manufacturer in the game - Birkenstocks. But that's a story for another day. 🙃</p>\n\n        <p style=\"font-size:1.3rem;\" class=\"feed-email-link\"><a href=\"mailto:23g@qrk.one?subject=Fact: Crocs Are the Best Shoes on Earth\">Reply to this post by email</a></p>\n",
				"date_published": "2023-07-17T01:00:00+01:00",
				"url": "https://qrk.social/2023/07/17/fact-crocs-are.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/07/16/aaaaaand-relax-cheers.html",
				
				"content_html": "<p>Aaaaaand relax. Cheers! 🍻</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Aaaaaand relax. Cheers! 🍻\n\n<img src=\"uploads/2023/c02286feb2.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-07-16T19:12:45+01:00",
				"url": "https://qrk.social/2023/07/16/aaaaaand-relax-cheers.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/07/16/tidy-garage-kind.html",
				
				"content_html": "<p>Tidy garage ✅ (kind of)</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Tidy garage ✅ (kind of)\n\n<img src=\"uploads/2023/5ffb97a4ae.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-07-16T19:11:05+01:00",
				"url": "https://qrk.social/2023/07/16/tidy-garage-kind.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/07/16/fix-guttering.html",
				
				"content_html": "<p>Fix guttering ✅</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "Fix guttering ✅\n\n<img src=\"uploads/2023/2da29f9fdf.jpg\" width=\"600\" height=\"450\" alt=\"\"><img src=\"uploads/2023/32784f53d5.jpg\" width=\"450\" height=\"600\" alt=\"\">\n",
				"date_published": "2023-07-16T19:04:15+01:00",
				"url": "https://qrk.social/2023/07/16/fix-guttering.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/07/16/walk-dogs.html",
				
				"content_html": "<p>Walk dogs ✅</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Walk dogs ✅\n\n<img src=\"uploads/2023/964fa310d4.jpg\" width=\"450\" height=\"600\" alt=\"\">\n",
				"date_published": "2023-07-16T18:08:38+01:00",
				"url": "https://qrk.social/2023/07/16/walk-dogs.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/07/16/clean-fish-tanks.html",
				
				"content_html": "<p>Clean fish tanks. ✅</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "Clean fish tanks. ✅\n\n<img src=\"uploads/2023/df0ea6f7f1.jpg\" width=\"600\" height=\"450\" alt=\"\"><img src=\"uploads/2023/f1ac933291.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-07-16T14:34:29+01:00",
				"url": "https://qrk.social/2023/07/16/clean-fish-tanks.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/07/16/mow-one-of.html",
				
				"content_html": "<p>Mow one of the fields ✅</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "Mow one of the fields ✅\n\n<img src=\"uploads/2023/817145c4ca.jpg\" width=\"600\" height=\"450\" alt=\"\"><img src=\"uploads/2023/151c2553ef.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-07-16T13:32:01+01:00",
				"url": "https://qrk.social/2023/07/16/mow-one-of.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/07/16/park-run.html",
				
				"content_html": "<p>Park Run ✅</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Park Run ✅\n\n<img src=\"uploads/2023/image.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-07-16T10:22:55+01:00",
				"url": "https://qrk.social/2023/07/16/park-run.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/07/16/plan-of-attack.html",
				
				"content_html": "<p>Plan of attack for today:</p>\n<ul>\n<li>Park Run with the kids</li>\n<li>Fix guttering on front of house</li>\n<li>Walk dogs</li>\n<li>Empty garage so I can start renovating it</li>\n<li>Mow one of the fields</li>\n<li>Water change and filter clean on 2x fish tanks</li>\n</ul>\n<p>I thought Sundays were supposed to be relaxing? 😳</p>\n",
				"content_text": "Plan of attack for today:\r\n\r\n* Park Run with the kids\r\n* Fix guttering on front of house\r\n* Walk dogs\r\n* Empty garage so I can start renovating it\r\n* Mow one of the fields\r\n* Water change and filter clean on 2x fish tanks\r\n\r\nI thought Sundays were supposed to be relaxing? 😳\n",
				"date_published": "2023-07-16T08:10:01+01:00",
				"url": "https://qrk.social/2023/07/16/plan-of-attack.html"
			},
			{
				"id": "http://kq.micro.blog/2023/07/10/how-it-all.html",
				"title": "How It All Connects",
				"content_html": "<!-- raw HTML omitted -->\n<pre><code>    &lt;p style=&quot;font-size:1.3rem;&quot; class=&quot;feed-email-link&quot;&gt;&lt;a href=&quot;mailto:23g@qrk.one?subject=How It All Connects&quot;&gt;Reply to this post by email&lt;/a&gt;&lt;/p&gt;\n</code></pre>\n",
				"content_text": "<p class=\"tldr\">There's some automation on this site that posts to various places, all via RSS. Here's how it works...</p>\n<p>There are a number of ways to <a href=\"/subscribe/\">subscribe to this blog</a> you can do it via RSS, email or on social media (Mastodon, Micro.blog or Bluesky). I've always been of the thinking that a reader shouldn't have to go hunting for my content; instead, it should be made available in whatever way makes sense to them.</p>\n<p>Problem is, distributing links (or the entire post) to multiple places can be a pain. I'd much prefer to publish my post and let the automation do the rest.</p>\n<p><a href=\"/please-add-rss-support-to-your-site\">I'm a big proponent of RSS</a> so that's where I started looking, and in the end RSS has become the backbone of how my content is distributed across the web.</p>\n<h2>What's shared, where?</h2>\n<p>Ok, so here's a list of where my content is distributed and in what form. All of this happens automatically within a couple of minutes of a new post being published.</p>\n<ul>\n<li><strong>RSS</strong> - <a href=\"/feed\">my RSS feed</a> contains the entire contents of my post and is immediately updated when a post is published</li>\n<li><strong>Email</strong> - thanks to the brilliant <a href=\"https://buttondown.email\">Buttondown</a> service, I'm able to regurgitate my RSS feed to email subscribers. Once again, this the entire post and is sent out around 10 minutes after the post is published</li>\n<li><strong>Micro.blog</strong> - I created a second feed called <code>social-feed.rss</code> which contains just the post description and a link. This is perfect for social media, so Micro.blog slurps up this feed and shares it there</li>\n<li><strong>Other socials</strong> - <a href=\"https://micro.blog/kq\">Micro.blog</a> then automatically cross-posts the contents of <code>social-feed.rss</code> to both my <a href=\"https://fosstodon.org/@kev\">Mastodon</a> and <a href=\"https://staging.bsky.app/profile/kev.blue\">Bluesky</a> accounts</li>\n</ul>\n<p>I love this setup - all I have to do is publish a post and my RSS feeds do the rest. It's fantastic. For those of you who are visual learners (I include myself in this bucket) here's a handy-dandy diagram that I threw together to show how it all connects:</p>\n<figure><img alt=\"A diagram of how my site connects to other services\" loading=\"lazy\" src=\"https://kevquirk.com/media/pages/blog/how-it-all-connects/c37af7f49e-1695904245/website-setup-diagram.png\"><figcaption>I really missed my calling as an artist</figcaption></figure>\n<h2>How much does it all cost?</h2>\n<p>Automation that's this simple to implement usually costs a lot of money, right? <strong>Wrong</strong>. All in, this site costs me $18/month to run, and is broken down as follows:</p>\n<ul>\n<li>Blot.im (website hosting) - $4/month</li>\n<li>Buttondown Basic - $9/month</li>\n<li>Micro.blog - $5/month</li>\n</ul>\n<p class=\"notice\">Micro.blog also supports other services that it can cross-post to. Currently Medium, Mastodon, LinkedIn, Tumblr, Flickr, BlueSky and Nostr are supported.</p>\n<p>I don't need any expensive plugins, or fancy (read: complicated) code to make this all work. It's all just RSS, and it's lovely.</p>\n\n        <p style=\"font-size:1.3rem;\" class=\"feed-email-link\"><a href=\"mailto:23g@qrk.one?subject=How It All Connects\">Reply to this post by email</a></p>\n",
				"date_published": "2023-07-10T01:00:00+01:00",
				"url": "https://qrk.social/2023/07/10/how-it-all.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/07/10/theres-some-automation.html",
				
				"content_html": "<p>There&rsquo;s some automation on this site that posts to various places, all via RSS. Here&rsquo;s how it works.<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/how-it-all-connects\">https://kevquirk.com/how-it-all-connects</a><!-- raw HTML omitted --></p>\n",
				"content_text": "There's some automation on this site that posts to various places, all via RSS. Here's how it works.   \r\n                <br><a href=\"https://kevquirk.com/how-it-all-connects\">https://kevquirk.com/how-it-all-connects</a>\n",
				"date_published": "2023-07-10T00:00:00+01:00",
				"url": "https://qrk.social/2023/07/10/theres-some-automation.html"
			},
			{
				"id": "http://kq.micro.blog/2023/07/08/im-back-microblog.html",
				
				"content_html": "<p>I’m back! micro.blog subscription renewed - I just can’t stay away. 😂</p>\n",
				"content_text": "I’m back! micro.blog subscription renewed - I just can’t stay away. 😂\n",
				"date_published": "2023-07-08T23:33:37+01:00",
				"url": "https://qrk.social/2023/07/08/im-back-microblog.html"
			},
			{
				"id": "http://kq.micro.blog/2023/07/02/a-case-for.html",
				"title": "A Case for Toe Socks",
				"content_html": "<!-- raw HTML omitted -->\n<pre><code>    &lt;p style=&quot;font-size:1.3rem;&quot; class=&quot;feed-email-link&quot;&gt;&lt;a href=&quot;mailto:23g@qrk.one?subject=A Case for Toe Socks&quot;&gt;Reply to this post by email&lt;/a&gt;&lt;/p&gt;\n</code></pre>\n",
				"content_text": "<div class=\"link\">\n  <h2>A case for socks with toes</h2>\n  <span>by Herman Martinus</span>\n  <p>Herman has been wearing toe socks exclusively for around 8 years. In this post he challenges the rest of us to try them too.</p>\n  <p><a class=\"dark-button\" target=\"blank\" href=\"https://herman.bearblog.dev/a-case-for-toe-socks/\">Read Post →</a></p>\n</div>\n<p>Not wanting to shy away from a challenge, I headed straight for Amazon and bought myself some toe socks. In his post, Herman lists a number of advantages to wearing toe socks, including them being <em>\"plain better for your toes\"</em>.</p>\n<figure><img alt=\"My toe socks\" src=\"https://kevquirk.com/media/pages/blog/a-case-for-toe-socks/c3f1a7c025-1695904245/toe-socks.webp\"><figcaption>My toe socks</figcaption></figure>\n<h2>My thoughts</h2>\n<p>So I've been wearing my toe socks for a little over a week now and honestly, I don't think I've seen the benefits of them yet. My toes do, however, feel like they have more freedom.</p>\n<p>Toe socks are <em>way</em> more annoying to put on than a traditional pair of socks. Firstly, they can't go on either foot - well, the ones I bought can't, anyway - this is because of the size of the toe holes, and the shape of the heel in the sock. So it makes pairing them after washing a pain.</p>\n<p>Secondly, my little toe kinda folds in on itself a little (maybe because I've been wearing traditional socks all these years? 🤯) so it's very annoying putting them on. I have to piss about with my little toe to get it in there. Usually it take around 90 seconds per foot to put a toe sock on.</p>\n<p>I have 2 dogs and a 2.5 acre smallholding, so I tend to do a lot of walking. I was hoping I'd really feel the benefit here, but honestly, my feet feel the same.</p>\n<p>I don't think I'll continue to wear toe socks exclusively, but I did buy 5 pairs, so I'll continue to wear them as and when I randomly pluck them out of my underwear drawer.</p>\n<p>Have you tried toe socks?</p>\n\n        <p style=\"font-size:1.3rem;\" class=\"feed-email-link\"><a href=\"mailto:23g@qrk.one?subject=A Case for Toe Socks\">Reply to this post by email</a></p>\n",
				"date_published": "2023-07-02T01:00:00+01:00",
				"url": "https://qrk.social/2023/07/02/a-case-for.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/07/02/id-love-a.html",
				"title": "I\u0026#039;d Love a Dumb Phone, But...",
				"content_html": "<!-- raw HTML omitted -->\n<pre><code>    &lt;p style=&quot;font-size:1.3rem;&quot; class=&quot;feed-email-link&quot;&gt;&lt;a href=&quot;mailto:23g@qrk.one?subject=I'd Love a Dumb Phone, But...&quot;&gt;Reply to this post by email&lt;/a&gt;&lt;/p&gt;\n</code></pre>\n",
				"content_text": "<p class=\"tldr\">\nI'd love to replace my iPhone with a dumb phone, but I don't think it would ever work in reality.\n</p>\n<p>I was recently perusing Youtube (as I sometimes do) and I came across a video about the <a href=\"https://www.punkt.ch/en/products/mp02-4g-mobile-phone/\">Punkt MP02</a>, which is effectively a dumb phone that supports <a href=\"https://signal.org\">Signal</a>.</p>\n<p><a href=\"/leave-whatsapp-messenger-nomad/\">As a Signal user myself</a>, this immediately engaged my grey matter and got me thinking about whether I could switch to a dumb phone, like the Punkt.</p>\n<figure><img alt=\"The Punkt MP02\" loading=\"lazy\" src=\"https://kevquirk.com/media/pages/blog/id-love-a-dumb-phone-but/37f1ee32f3-1695904245/punkt-mp02.webp\"><figcaption>The Punkt MP02</figcaption></figure>\n<p>My knee-jerk reaction was <em>\"this looks great, I could definitely replace my iPhone with this. How much is it...\"</em> but after giving it some thought, I decided I most definitely could <em>not</em> ditch my iPhone for a dumb phone.</p>\n<p class=\"notice\">\nYou can pick up a Punkt MP02 for around £200 - £300, by the way.\n</p>\n<h2>Thinking it through</h2>\n<p>After taking a minute to actually think this through, it quickly became apparent that, no, I couldn't replace my iPhone. And that's not because I'm addicted to a particular app; having an iPhone just makes my life easier.</p>\n<p>I don't just use Signal for messaging. I also use WhatsApp and iMessage regularly, so the Punkt would already be out.</p>\n<p>Yeah, I <em>could</em> live without WhatsApp and iMessage - people could still SMS me...or, you know, call...but it would make it more difficult for people to contact me.</p>\n<p>It's also the other, small, quality of life stuff that would make the transition extremely difficult for me.</p>\n<p>For example, all my music is on Apple Music, and I don't have the time (or inclination) to manage my own music library any more. I <em>could</em> do it, but I have other things I'd prefer to spend my time on. I like the fact that if anyone in my family hears a song we like, it's very likely the song is available in Apple Music and we can quickly add it to a playlist.</p>\n<p>If I managed my own music library, I'd also need a way of playing it everywhere I listen, so that would mean an media player of some kind. Then there's Audiobooks and Podcasts - I don't even know how I'd listen them on the go, without my iPhone.</p>\n<p>There's also the camera - I don't use it often, but it's nice to snap little memories here and there. Plus, my wife tends to send me pics on the regular.</p>\n<p>Finally there's all the other \"<em>stuff</em>\" - Apple Maps for navigation, IMBD for looking up that person who I recognise, but I don't know where from, mobile banking, email, the weather and of course, the web browser.</p>\n<p>None of it is <em>that</em> important, and some of it could probably be done on the Punkt too, but it's all so easy on the iPhone.</p>\n<h2>It's a no from me...</h2>\n<p>So I have to ask myself - if I already own the iPhone, and it makes my life easier, why would I replace it? Especially if replacing it means I'd have to buy at least 2 new devices (a new phone and a media player), as well waste a tonne of time managing unnecessary admin, all while making myself more difficult to contact.</p>\n<p>In hindsight, keeping the iPhone is a no-brainer. I <em>love</em> the idea and simplicity of having a dumb phone, but the reality is that life isn't that simple and it would be a hindrance <strong>for me</strong>.</p>\n<p><strong>What about you? would/could you ditch your smart phone for a dumb phone? Have you tried it? I'd love to hear about your thoughts/experiences with all this.</strong></p>\n\n        <p style=\"font-size:1.3rem;\" class=\"feed-email-link\"><a href=\"mailto:23g@qrk.one?subject=I'd Love a Dumb Phone, But...\">Reply to this post by email</a></p>\n",
				"date_published": "2023-07-02T01:00:00+01:00",
				"url": "https://qrk.social/2023/07/02/id-love-a.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/07/02/id-love-to.html",
				
				"content_html": "<p>I&rsquo;d love to replace my iPhone with a dumb phone, but I don&rsquo;t think it would ever work in reality.<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/i-d-love-a-dumb-phone-but%E2%80%A6\">https://kevquirk.com/i-d-love-a-dumb-phone-but%E2%80%A6</a><!-- raw HTML omitted --></p>\n",
				"content_text": "I'd love to replace my iPhone with a dumb phone, but I don't think it would ever work in reality.   \r\n                <br><a href=\"https://kevquirk.com/i-d-love-a-dumb-phone-but%E2%80%A6\">https://kevquirk.com/i-d-love-a-dumb-phone-but%E2%80%A6</a>\n",
				"date_published": "2023-07-02T00:00:00+01:00",
				"url": "https://qrk.social/2023/07/02/id-love-to.html"
			},
			{
				"id": "http://kq.micro.blog/2023/07/02/null-httpskevquirkcomacasefortoesocks.html",
				
				"content_html": "<p>null<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/a-case-for-toe-socks\">https://kevquirk.com/a-case-for-toe-socks</a><!-- raw HTML omitted --></p>\n",
				"content_text": "null   \r\n                <br><a href=\"https://kevquirk.com/a-case-for-toe-socks\">https://kevquirk.com/a-case-for-toe-socks</a>\n",
				"date_published": "2023-07-02T00:00:00+01:00",
				"url": "https://qrk.social/2023/07/02/null-httpskevquirkcomacasefortoesocks.html"
			},
			{
				"id": "http://kq.micro.blog/2023/06/22/getting-ready-for.html",
				"title": "Getting Ready for Winter",
				"content_html": "<!-- raw HTML omitted -->\n<pre><code>    &lt;p style=&quot;font-size:1.3rem;&quot; class=&quot;feed-email-link&quot;&gt;&lt;a href=&quot;mailto:23g@qrk.one?subject=Getting Ready for Winter&quot;&gt;Reply to this post by email&lt;/a&gt;&lt;/p&gt;\n</code></pre>\n",
				"content_text": "<p class=\"tldr\">\nEven though it's currently summer, we're already preparing ourselves for the long Welsh winter ahead.\n</p>\n<p>Even though it's the middle of summer, we had 2 tonnes of fire wood delivered yesterday. We're obviously not using our fire at the moment, but when it comes to the long, harsh Welsh winters, you need all the firewood you can get.</p>\n<p>When I was in the Army, we had a saying called \"<em>the 7 P's</em>\". Which where:</p>\n<blockquote>\n<p>Prior planning and preparation prevents piss poor performance.</p>\n<p><cite>The 7 P's</cite></p>\n</blockquote>\n<p>We recently cut some trees down on our land, but they're going to need some time to dry out - probably 6-12 months, I should think. Unfortunately, the previous owner (understandably) didn't leave us with a wood cache, so we're having to build our own.</p>\n<figure><img alt=\"Wood I still need to chop & dry out\" loading=\"lazy\" src=\"https://kevquirk.com/media/pages/blog/getting-ready-for-winter/8d3dda5c71-1695904245/tree-wood-not-chopped.webp\"><figcaption>Wood I still need to chop & dry out</figcaption></figure>\n<p>Now, we could buy wood as winter hits, when demand is at it's highest, or we could buy a load of wood now, in the summer, when demand is at it's lowest. Supply and demand, folks - it's always gonna be cheaper when demand is at it's lowest.</p>\n<p>So we called up the local farmer and asked him to drop off 2 tonnes of chopped and dried firewood. Problem is, he couldn't get his trailer around the corner of our house to where we intend to store the wood, so he had to drop it on the drive. Which in turn meant I had to cart it up the hill to our stables. 🤦‍♂️</p>\n<figure><img alt=\"2 tonnes of wood on the drive\" src=\"https://kevquirk.com/media/pages/blog/getting-ready-for-winter/b214d291ad-1695904245/fire-wood-2-tonnes.webp\"><figcaption>2 tonnes of wood on the drive</figcaption></figure>\n<p>Doesn't look like much in the picture, does it? But look at the buckets to the right. They're full-size builders buckets, so that should give you an idea of scale.</p>\n<p>We were due to get a thunderstorm that evening, so I had to get the wood inside ASAP. It was already 8pm and I'd had a full day at work too. The joys of owning a smallholding. 🙃</p>\n<p>We have a Husqvarna 4x4 mower with a small trailer, so I decided to fire her up and use that to shift the logs. Still took me a good 15 trips though.</p>\n<figure><img alt=\"Fire wood on trailer\" src=\"https://kevquirk.com/media/pages/blog/getting-ready-for-winter/b5c96ca809-1695904245/fire-wood-on-trailer.webp\"></figure>\n<h2>Full stack (wood) developer</h2>\n<p>After an hour and a half, lots of sweat and some grazed shins (thanks to stray blocks falling off my stacks and right onto my shins), I was done.</p>\n<p>It was hard work, as with many things on our little plot, but I really enjoy the work. I put some music on and just chug along. Plus, it's good exercise.</p>\n<figure><img alt=\"Fire wood in the wood store\" src=\"https://kevquirk.com/media/pages/blog/getting-ready-for-winter/05a159337d-1695904245/fire-wood-store.webp\"></figure>\n<p>I still don't think this is going to be enough to see us through an entire winter, let alone multiple winters. So next I need to get the felled trees chopped up and add them to the store. Then, as autumn and winter hits, and the birds stop nesting, we can cut down other trees and continue the cycle.</p>\n<p>I'd like to get to the point where we're pretty much self-sufficient with fire food and have enough in our store to allow at least a year for the wood to dry out properly.</p>\n<p>We shall see...</p>\n<p class=\"notice\">\nEnjoying these posts about the smallholding? If so, please do let me know so I can gauge interest. If they're pissing you off, I'd like to know that too, as I'm really enjoying writing this stuff, so if enough people on here don't like it, I'll create a mini-site or something.\n</p>\n\n        <p style=\"font-size:1.3rem;\" class=\"feed-email-link\"><a href=\"mailto:23g@qrk.one?subject=Getting Ready for Winter\">Reply to this post by email</a></p>\n",
				"date_published": "2023-06-22T01:00:00+01:00",
				"url": "https://qrk.social/2023/06/22/getting-ready-for.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/06/22/even-though-its.html",
				
				"content_html": "<p>Even though it&rsquo;s currently summer, we&rsquo;re already preparing ourselves for the long Welsh winter ahead.<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/getting-ready-for-winter\">https://kevquirk.com/getting-ready-for-winter</a><!-- raw HTML omitted --></p>\n",
				"content_text": "Even though it's currently summer, we're already preparing ourselves for the long Welsh winter ahead.   \r\n                <br><a href=\"https://kevquirk.com/getting-ready-for-winter\">https://kevquirk.com/getting-ready-for-winter</a>\n",
				"date_published": "2023-06-22T00:00:00+01:00",
				"url": "https://qrk.social/2023/06/22/even-though-its.html"
			},
			{
				"id": "http://kq.micro.blog/2023/06/18/we-now-have.html",
				
				"content_html": "<p>We now have 4 cows grazing in one of our fields, and it&rsquo;s brilliant.<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/cows\">https://kevquirk.com/cows</a><!-- raw HTML omitted --></p>\n",
				"content_text": "We now have 4 cows grazing in one of our fields, and it's brilliant.   \r\n                <br><a href=\"https://kevquirk.com/cows\">https://kevquirk.com/cows</a>\n",
				"date_published": "2023-06-18T00:00:00+01:00",
				"url": "https://qrk.social/2023/06/18/we-now-have.html"
			},
			{
				"id": "http://kq.micro.blog/2023/06/12/ive-been-staring.html",
				
				"content_html": "<p>I&rsquo;ve been staring at a blank box for a little bit now, trying to work out what to write. This has never happened to me before. I think I know why&hellip;<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/the-blank-box\">https://kevquirk.com/the-blank-box</a><!-- raw HTML omitted --></p>\n",
				"content_text": "I've been staring at a blank box for a little bit now, trying to work out what to write. This has never happened to me before. I think I know why...   \r\n                <br><a href=\"https://kevquirk.com/the-blank-box\">https://kevquirk.com/the-blank-box</a>\n",
				"date_published": "2023-06-12T00:00:00+01:00",
				"url": "https://qrk.social/2023/06/12/ive-been-staring.html"
			},
			{
				"id": "http://kq.micro.blog/2023/06/06/yesterday-was-the.html",
				
				"content_html": "<p>Yesterday was the Apple 2023 WWDC conference. There were some big announcements, here&rsquo;s my thoughts&hellip;<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/apple-wwdc-2023-my-thoughts\">https://kevquirk.com/apple-wwdc-2023-my-thoughts</a><!-- raw HTML omitted --></p>\n",
				"content_text": "Yesterday was the Apple 2023 WWDC conference. There were some big announcements, here's my thoughts...   \r\n                <br><a href=\"https://kevquirk.com/apple-wwdc-2023-my-thoughts\">https://kevquirk.com/apple-wwdc-2023-my-thoughts</a>\n",
				"date_published": "2023-06-06T00:00:00+01:00",
				"url": "https://qrk.social/2023/06/06/yesterday-was-the.html"
			},
			{
				"id": "http://kq.micro.blog/2023/06/03/i-was-nearly.html",
				
				"content_html": "<p>I was nearly scammed while selling a car on AutoTrader. Here&rsquo;s how the whole thing went&hellip;<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/autotrader-scammers\">https://kevquirk.com/autotrader-scammers</a><!-- raw HTML omitted --></p>\n",
				"content_text": "I was nearly scammed while selling a car on AutoTrader. Here's how the whole thing went...   \r\n                <br><a href=\"https://kevquirk.com/autotrader-scammers\">https://kevquirk.com/autotrader-scammers</a>\n",
				"date_published": "2023-06-03T00:00:00+01:00",
				"url": "https://qrk.social/2023/06/03/i-was-nearly.html"
			},
			{
				"id": "http://kq.micro.blog/2023/05/30/words-of-radiance.html",
				
				"content_html": "<p>Words of Radiance is another fantastic book by Brandon Sanderson.<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/words-of-radiance\">https://kevquirk.com/words-of-radiance</a><!-- raw HTML omitted --></p>\n",
				"content_text": "Words of Radiance is another fantastic book by Brandon Sanderson.   \r\n                <br><a href=\"https://kevquirk.com/words-of-radiance\">https://kevquirk.com/words-of-radiance</a>\n",
				"date_published": "2023-05-30T00:00:00+01:00",
				"url": "https://qrk.social/2023/05/30/words-of-radiance.html"
			},
			{
				"id": "http://kq.micro.blog/2023/05/15/jatan-talks-about.html",
				
				"content_html": "<p>Jatan talks about why you should have underlined links to make things discoverable and accessible for your readers.<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/underline-your-links\">https://kevquirk.com/underline-your-links</a><!-- raw HTML omitted --></p>\n",
				"content_text": "Jatan talks about why you should have underlined links to make things discoverable and accessible for your readers.   \r\n                <br><a href=\"https://kevquirk.com/underline-your-links\">https://kevquirk.com/underline-your-links</a>\n",
				"date_published": "2023-05-15T00:00:00+01:00",
				"url": "https://qrk.social/2023/05/15/jatan-talks-about.html"
			},
			{
				"id": "http://kq.micro.blog/2023/05/10/following-my-last.html",
				
				"content_html": "<p>Following my last post, I&rsquo;ve made some changes to the way in which I consume social media.<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/anti-social-update\">https://kevquirk.com/anti-social-update</a><!-- raw HTML omitted --></p>\n",
				"content_text": "Following my last post, I've made some changes to the way in which I consume social media.   \r\n                <br><a href=\"https://kevquirk.com/anti-social-update\">https://kevquirk.com/anti-social-update</a>\n",
				"date_published": "2023-05-10T00:00:00+01:00",
				"url": "https://qrk.social/2023/05/10/following-my-last.html"
			},
			{
				"id": "http://kq.micro.blog/2023/05/03/saw-this-post.html",
				
				"content_html": "<p>Saw <a href=\"https://email-is-good.com/2023/05/02/email-pen-pals/\">this post by Chris Coyier</a>. I’d love an email Pen Pal - I think it’s a great idea. 📨</p>\n",
				"content_text": "Saw [this post by Chris Coyier](https://email-is-good.com/2023/05/02/email-pen-pals/). I’d love an email Pen Pal - I think it’s a great idea. 📨\n",
				"date_published": "2023-05-03T09:40:15+01:00",
				"url": "https://qrk.social/2023/05/03/saw-this-post.html"
			},
			{
				"id": "http://kq.micro.blog/2023/05/01/some-thoughts-on.html",
				
				"content_html": "<p>Some thoughts on the subscription culture that we find ourselves in when it comes to online services.</p>\n<p><a href=\"https://kevquirk.com/it-only-costs-a-coffee-per-month\">kevquirk.com/it-only-c&hellip;</a></p>\n",
				"content_text": "Some thoughts on the subscription culture that we find ourselves in when it comes to online services.\r\n\r\n[kevquirk.com/it-only-c...](https://kevquirk.com/it-only-costs-a-coffee-per-month)\r\n",
				"date_published": "2023-05-01T13:25:40+01:00",
				"url": "https://qrk.social/2023/05/01/some-thoughts-on.html"
			},
			{
				"id": "http://kq.micro.blog/2023/05/01/most-online-services.html",
				
				"content_html": "<p>Most online services cost &ldquo;a coffee per month&rdquo; which seems like a great deal, but it soon mounts up.<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/it-only-costs-a-coffee-per-month\">https://kevquirk.com/it-only-costs-a-coffee-per-month</a><!-- raw HTML omitted --></p>\n",
				"content_text": "Most online services cost \"a coffee per month\" which seems like a great deal, but it soon mounts up.   \r\n                <br><a href=\"https://kevquirk.com/it-only-costs-a-coffee-per-month\">https://kevquirk.com/it-only-costs-a-coffee-per-month</a>\n",
				"date_published": "2023-05-01T00:00:00+01:00",
				"url": "https://qrk.social/2023/05/01/most-online-services.html"
			},
			{
				"id": "http://kq.micro.blog/2023/04/30/i-honestly-dont.html",
				
				"content_html": "<p>I honestly don’t understand how anyone can wear Crocs without socks. They rub my toe nails and it makes me feel physically sick. 🤮</p>\n<p>Modern day philosophy right here, people!</p>\n",
				"content_text": "I honestly don’t understand how anyone can wear Crocs without socks. They rub my toe nails and it makes me feel physically sick. 🤮\n\nModern day philosophy right here, people!\n",
				"date_published": "2023-04-30T22:18:20+01:00",
				"url": "https://qrk.social/2023/04/30/i-honestly-dont.html"
			},
			{
				"id": "http://kq.micro.blog/2023/04/28/i-told-my.html",
				
				"content_html": "<p>I told my wife I wouldn’t buy anymore watches, and to prove it, all my cases are full and I won’t buy another case…</p>\n<p>Do you think she’ll notice that extra watch squirrelled away at the back there? 😳 ⌚️</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "I told my wife I wouldn’t buy anymore watches, and to prove it, all my cases are full and I won’t buy another case…\n\nDo you think she’ll notice that extra watch squirrelled away at the back there? 😳 ⌚️\n\n<img src=\"uploads/2023/60fda2f8f6.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-04-28T21:50:34+01:00",
				"url": "https://qrk.social/2023/04/28/i-told-my.html",
				"tags": ["Watches","Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/04/27/this-is-why.html",
				
				"content_html": "<p>This is why I really dislike Ghost. Nearly half a MB of JavaScript is just ridiculous.</p>\n<p>No site needs that much JS, IMO.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "This is why I really dislike Ghost. Nearly half a MB of JavaScript is just ridiculous.\n\nNo site needs that much JS, IMO.\n\n<img src=\"uploads/2023/812175a1b7.jpg\" width=\"456\" height=\"600\" alt=\"\">\n",
				"date_published": "2023-04-27T18:18:54+01:00",
				"url": "https://qrk.social/2023/04/27/this-is-why.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/04/25/as-a-coadmin.html",
				
				"content_html": "<p>As a co-admin of a large Mastodon instance, this is very close to the bone, and accurate, I’m sad to say…</p>\n<p><a href=\"https://justingarrison.com/blog/2023-04-24-mastodon-is-doomed/\">https://justingarrison.com/blog/2023-04-24-mastodon-is-doomed/</a></p>\n",
				"content_text": "As a co-admin of a large Mastodon instance, this is very close to the bone, and accurate, I’m sad to say…\n\n[https://justingarrison.com/blog/2023-04-24-mastodon-is-doomed/](https://justingarrison.com/blog/2023-04-24-mastodon-is-doomed/)\n",
				"date_published": "2023-04-25T19:02:14+01:00",
				"url": "https://qrk.social/2023/04/25/as-a-coadmin.html"
			},
			{
				"id": "http://kq.micro.blog/2023/04/24/i-know-im.html",
				
				"content_html": "<p>I know I’m bias, but c’mon. The little fella really is a handsome little grey thing. 😊</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "I know I’m bias, but c’mon. The little fella really is a handsome little grey thing. 😊\n\n<img src=\"uploads/2023/7f20f9c41a.jpg\" width=\"600\" height=\"600\" alt=\"\">\n",
				"date_published": "2023-04-24T22:45:18+01:00",
				"url": "https://qrk.social/2023/04/24/i-know-im.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/04/24/hope-so-you.html",
				
				"content_html": "<p>How do you folks discover new people to follow here on Micro.blog?</p>\n<p>Is it a natural thing that just evolved over time? Do you go hunting for people? Or is it something else entirely? I’d love to know how you guys have grown your network here, as I’m sure there’s a load more interesting people here that I’m missing out on.</p>\n",
				"content_text": "How do you folks discover new people to follow here on Micro.blog?\n\nIs it a natural thing that just evolved over time? Do you go hunting for people? Or is it something else entirely? I’d love to know how you guys have grown your network here, as I’m sure there’s a load more interesting people here that I’m missing out on.\n",
				"date_published": "2023-04-24T20:15:12+01:00",
				"url": "https://qrk.social/2023/04/24/hope-so-you.html"
			},
			{
				"id": "http://kq.micro.blog/2023/04/24/i-bought-myself.html",
				
				"content_html": "<p>I bought myself a Remarkable 2 a couple months ago. Here&rsquo;s some of my initial thoughts on how it&rsquo;s been going.</p>\n<p><a href=\"https://kevquirk.com/my-thoughts-on-the-remarkable-2\">kevquirk.com/my-though&hellip;</a></p>\n",
				"content_text": "I bought myself a Remarkable 2 a couple months ago. Here's some of my initial thoughts on how it's been going.\r\n\r\n[kevquirk.com/my-though...](https://kevquirk.com/my-thoughts-on-the-remarkable-2)\r\n",
				"date_published": "2023-04-24T13:32:23+01:00",
				"url": "https://qrk.social/2023/04/24/i-bought-myself.html"
			},
			{
				"id": "http://kq.micro.blog/2023/04/24/ive-had-my.html",
				
				"content_html": "<p>I&rsquo;ve had my Remarkable 2 for a couple months now, so I think it&rsquo;s about time I shared some thoughts on it.<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/my-thoughts-on-the-remarkable-2\">https://kevquirk.com/my-thoughts-on-the-remarkable-2</a><!-- raw HTML omitted --></p>\n",
				"content_text": "I've had my Remarkable 2 for a couple months now, so I think it's about time I shared some thoughts on it.   \r\n                <br><a href=\"https://kevquirk.com/my-thoughts-on-the-remarkable-2\">https://kevquirk.com/my-thoughts-on-the-remarkable-2</a>\n",
				"date_published": "2023-04-24T00:00:00+01:00",
				"url": "https://qrk.social/2023/04/24/ive-had-my.html"
			},
			{
				"id": "http://kq.micro.blog/2023/04/23/lovely-walk-in.html",
				
				"content_html": "<p>Lovely walk in the hills with the pooches today. Needed some time on my own…\n🐾</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "Lovely walk in the hills with the pooches today. Needed some time on my own…\n🐾\n\n<img src=\"uploads/2023/c2155613d8.jpg\" width=\"600\" height=\"450\" alt=\"\"><img src=\"uploads/2023/fb0a63930a.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-04-23T19:24:38+01:00",
				"url": "https://qrk.social/2023/04/23/lovely-walk-in.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/04/23/ive-felt-a.html",
				
				"content_html": "<p>I’ve felt a bit…<em>meh</em> about social media recently so wanted to jot down some thoughts about it all. Something has to change WRT the way I use social media. I just don&rsquo;t know <strong>what</strong>. Any ideas, folks?</p>\n<p><a href=\"https://kevquirk.com/anti-social-media\">kevquirk.com/anti-soci&hellip;</a></p>\n",
				"content_text": "I’ve felt a bit…*meh* about social media recently so wanted to jot down some thoughts about it all. Something has to change WRT the way I use social media. I just don't know **what**. Any ideas, folks?\n\n[kevquirk.com/anti-soci...](https://kevquirk.com/anti-social-media)\n",
				"date_published": "2023-04-23T10:37:29+01:00",
				"url": "https://qrk.social/2023/04/23/ive-felt-a.html"
			},
			{
				"id": "http://kq.micro.blog/2023/04/23/000000.html",
				
				"content_html": "<p>I&rsquo;ve felt a bit&hellip;meh about social media recently so wanted to jot down some thoughts about it all.<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/anti-social-media\">https://kevquirk.com/anti-social-media</a><!-- raw HTML omitted --></p>\n",
				"content_text": "I've felt a bit...meh about social media recently so wanted to jot down some thoughts about it all.   \r\n                <br><a href=\"https://kevquirk.com/anti-social-media\">https://kevquirk.com/anti-social-media</a>\n",
				"date_published": "2023-04-23T00:00:00+01:00",
				"url": "https://qrk.social/2023/04/23/000000.html"
			},
			{
				"id": "http://kq.micro.blog/2023/04/22/i-serviced-one.html",
				
				"content_html": "<p>I serviced one of the motorbikes today. The previous owner assured me that a thorough service had been done last year. I’m struggling to believe him now. 😂</p>\n<p>🏍️</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "I serviced one of the motorbikes today. The previous owner assured me that a thorough service had been done last year. I’m struggling to believe him now. 😂\n\n🏍️\n\n<img src=\"uploads/2023/79a53af215.jpg\" width=\"600\" height=\"600\" alt=\"\">\n",
				"date_published": "2023-04-22T19:29:33+01:00",
				"url": "https://qrk.social/2023/04/22/i-serviced-one.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/04/21/just-reading-this.html",
				
				"content_html": "<p>Just reading <a href=\"https://chriscoyier.net/2023/04/21/the-secret-list-of-websites/\">this post</a> by <a href=\"https://front-end.social/@chriscoyier\">@chriscoyier@front-end.social</a>, which is about the websites used to train Google’s AI. Was really surprised to see my little site listed there! 😳</p>\n<p>Was nice to be asked…</p>\n<blockquote>\n<p>Google should be encouraging and fighting for the open web. But now they’re like, actually we’re just going to suck up your website, put it in a blender with all other websites, and spit out word smoothies for people instead of sending them to your website.</p>\n</blockquote>\n<p>Hear, hear, Chris</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Just reading [this post](https://chriscoyier.net/2023/04/21/the-secret-list-of-websites/) by [@chriscoyier@front-end.social](https://front-end.social/@chriscoyier), which is about the websites used to train Google’s AI. Was really surprised to see my little site listed there! 😳\n\nWas nice to be asked…\n\n> Google should be encouraging and fighting for the open web. But now they’re like, actually we’re just going to suck up your website, put it in a blender with all other websites, and spit out word smoothies for people instead of sending them to your website.\n\nHear, hear, Chris\n\n<img src=\"uploads/2023/26986bbfd5.jpg\" width=\"600\" height=\"150\" alt=\"\">\n",
				"date_published": "2023-04-21T22:44:26+01:00",
				"url": "https://qrk.social/2023/04/21/just-reading-this.html",
				"tags": ["Links"]
			},
			{
				"id": "http://kq.micro.blog/2023/04/20/renewed-my-miniflux.html",
				
				"content_html": "<p>Renewed my Miniflux subscription for another year. Best RSS feeder out there. 👌</p>\n<p><a href=\"https://miniflux.app/\">miniflux.app</a></p>\n",
				"content_text": "Renewed my Miniflux subscription for another year. Best RSS feeder out there. 👌\n\n[miniflux.app](https://miniflux.app/)\n",
				"date_published": "2023-04-20T07:02:41+01:00",
				"url": "https://qrk.social/2023/04/20/renewed-my-miniflux.html"
			},
			{
				"id": "http://kq.micro.blog/2023/04/19/ive-finally-made.html",
				
				"content_html": "<p>I’ve finally made the switch from #Jekyll to #Blot. This post talks about some of the technical challenges of that process, but overall, I’m <em>very</em> happy! 📝</p>\n<p><a href=\"https://kevquirk.com/moving-from-jekyll-to-blot\">kevquirk.com/moving-fr&hellip;</a></p>\n",
				"content_text": "I’ve finally made the switch from #Jekyll to #Blot. This post talks about some of the technical challenges of that process, but overall, I’m _very_ happy! 📝\n\n[kevquirk.com/moving-fr...](https://kevquirk.com/moving-from-jekyll-to-blot)\n",
				"date_published": "2023-04-19T19:11:13+01:00",
				"url": "https://qrk.social/2023/04/19/ive-finally-made.html"
			},
			{
				"id": "http://kq.micro.blog/2023/04/19/ive-been-exploring.html",
				
				"content_html": "<p>I&rsquo;ve been exploring Blot lately. It&rsquo;s great, so I&rsquo;ve decided to move this site over to it from Jekyll.<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/moving-from-jekyll-to-blot\">https://kevquirk.com/moving-from-jekyll-to-blot</a><!-- raw HTML omitted --></p>\n",
				"content_text": "I've been exploring Blot lately. It's great, so I've decided to move this site over to it from Jekyll.   \r\n                <br><a href=\"https://kevquirk.com/moving-from-jekyll-to-blot\">https://kevquirk.com/moving-from-jekyll-to-blot</a>\n",
				"date_published": "2023-04-19T00:00:00+01:00",
				"url": "https://qrk.social/2023/04/19/ive-been-exploring.html"
			},
			{
				"id": "http://kq.micro.blog/2023/04/18/ted-lasso-is.html",
				
				"content_html": "<p>Ted Lasso is absolutely brilliant.</p>\n<p>That’s it. That’s the post.</p>\n",
				"content_text": "Ted Lasso is absolutely brilliant.\n\nThat’s it. That’s the post.\n",
				"date_published": "2023-04-18T23:21:07+01:00",
				"url": "https://qrk.social/2023/04/18/ted-lasso-is.html"
			},
			{
				"id": "http://kq.micro.blog/2023/04/18/i-need-these.html",
				
				"content_html": "<p>I need these. All of these. In my life. ⌚️</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "I need these. All of these. In my life. ⌚️\n\n<img src=\"uploads/2023/76db76bc87.jpg\" width=\"600\" height=\"424\" alt=\"\">\n",
				"date_published": "2023-04-18T20:15:52+01:00",
				"url": "https://qrk.social/2023/04/18/i-need-these.html",
				"tags": ["Watches","Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/04/17/just-finished-reading.html",
				
				"content_html": "<p>Just finished reading <a href=\"https://kevquirk.com/the-way-of-kings\">The Way Of Kings</a> by Brandon Sanderson. 📚</p>\n<p>Throughly enjoyed this book. I can&rsquo;t recommend it highly enough.</p>\n",
				"content_text": "Just finished reading [The Way Of Kings](https://kevquirk.com/the-way-of-kings) by Brandon Sanderson. 📚\r\n\r\nThroughly enjoyed this book. I can't recommend it highly enough.\n",
				"date_published": "2023-04-17T17:10:54+01:00",
				"url": "https://qrk.social/2023/04/17/just-finished-reading.html",
				"tags": ["Books"]
			},
			{
				"id": "http://kq.micro.blog/2023/04/17/took-the-dogs.html",
				
				"content_html": "<p>Took the dogs out for a walk on our land at lunch. Spring has definitely sprung - there&rsquo;s so much colour about! 📸</p>\n<p>Oh, and Sidney says hi! 🐾</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "Took the dogs out for a walk on our land at lunch. Spring has definitely sprung - there's so much colour about! 📸\r\n\r\nOh, and Sidney says hi! 🐾\r\n\n\n<img src=\"uploads/2023/c887f6f5ab.jpg\" width=\"600\" height=\"450\" alt=\"\"><img src=\"uploads/2023/c4d999c13f.jpg\" width=\"600\" height=\"450\" alt=\"\"><img src=\"uploads/2023/790987173c.jpg\" width=\"600\" height=\"450\" alt=\"\"><img src=\"uploads/2023/028b77cb4a.jpg\" width=\"600\" height=\"450\" alt=\"\"><img src=\"uploads/2023/1d0a72d2a4.jpg\" width=\"600\" height=\"450\" alt=\"\"><img src=\"uploads/2023/65dc66fbd1.jpg\" width=\"600\" height=\"450\" alt=\"\"><img src=\"uploads/2023/764d04327e.jpg\" width=\"600\" height=\"450\" alt=\"\"><img src=\"uploads/2023/6fc43137dd.jpg\" width=\"600\" height=\"450\" alt=\"\"><img src=\"uploads/2023/895a72b982.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-04-17T16:44:41+01:00",
				"url": "https://qrk.social/2023/04/17/took-the-dogs.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/04/17/over-the-last.html",
				
				"content_html": "<p>Over the last few months I seem to have forgone podcasts in favour of audiobooks. I even flipped my eReader from Kobo to Kindle, just so I could use WhisperSync to flip between audiobooks and ebooks.</p>\n<p>I do miss some of the regular podcasts I listened to. I should make more of an effort…</p>\n",
				"content_text": "Over the last few months I seem to have forgone podcasts in favour of audiobooks. I even flipped my eReader from Kobo to Kindle, just so I could use WhisperSync to flip between audiobooks and ebooks.\n\nI do miss some of the regular podcasts I listened to. I should make more of an effort…\n",
				"date_published": "2023-04-17T07:18:36+01:00",
				"url": "https://qrk.social/2023/04/17/over-the-last.html"
			},
			{
				"id": "http://kq.micro.blog/2023/04/17/the-darktheme-club.html",
				
				"content_html": "<p>🔗 <strong><a href=\"https://darktheme.club/\">The Darktheme Club</a></strong> by <a href=\"https://micro.blog/garritfra@fosstodon.org\">@garritfra@fosstodon.org</a> is a really cool project.</p>\n<blockquote>\n<p>With the internet being ever present and screens surrounding us all the time, personal preference is becoming more and more critical for a good user experience. Particularly when it comes to dark mode in order not to burn out the readers sight at night.</p>\n</blockquote>\n",
				"content_text": "🔗 **[The Darktheme Club](https://darktheme.club/)** by [@garritfra@fosstodon.org](https://micro.blog/garritfra@fosstodon.org) is a really cool project.\n\n> With the internet being ever present and screens surrounding us all the time, personal preference is becoming more and more critical for a good user experience. Particularly when it comes to dark mode in order not to burn out the readers sight at night.\n",
				"date_published": "2023-04-17T07:11:11+01:00",
				"url": "https://qrk.social/2023/04/17/the-darktheme-club.html",
				"tags": ["Links"]
			},
			{
				"id": "http://kq.micro.blog/2023/04/17/the-way-of.html",
				
				"content_html": "<p>The Way of Kings is a fantastic book by Brandon Sanderson. One of the best I&rsquo;ve read in a while.<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/the-way-of-kings\">https://kevquirk.com/the-way-of-kings</a><!-- raw HTML omitted --></p>\n",
				"content_text": "The Way of Kings is a fantastic book by Brandon Sanderson. One of the best I've read in a while.   \r\n                <br><a href=\"https://kevquirk.com/the-way-of-kings\">https://kevquirk.com/the-way-of-kings</a>\n",
				"date_published": "2023-04-17T00:00:00+01:00",
				"url": "https://qrk.social/2023/04/17/the-way-of.html"
			},
			{
				"id": "http://kq.micro.blog/2023/04/15/the-old-girl.html",
				
				"content_html": "<p>The old girl is 20 years old, but blimey she still scrubs up well! 🏍️</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "The old girl is 20 years old, but blimey she still scrubs up well! 🏍️\n\n<img src=\"uploads/2023/695296be0c.jpg\" width=\"600\" height=\"450\" alt=\"\"><img src=\"uploads/2023/180a3f3faa.jpg\" width=\"600\" height=\"600\" alt=\"\"><img src=\"uploads/2023/4556816018.jpg\" width=\"600\" height=\"600\" alt=\"\">\n",
				"date_published": "2023-04-15T19:22:58+01:00",
				"url": "https://qrk.social/2023/04/15/the-old-girl.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/04/15/ive-heard-lots.html",
				
				"content_html": "<p>I’ve heard lots of people saying good thing about <a href=\"https://omg.lol\">omg.lol</a>, so I thought I’d sign up and see what it’s all about. Plus, you know, it’s supporting indie developers.</p>\n<p>It’s a fun project, you should check it out. Here’s my profile - <a href=\"https://kq.omg.lol\">https://kq.omg.lol</a></p>\n",
				"content_text": "I’ve heard lots of people saying good thing about [omg.lol](https://omg.lol), so I thought I’d sign up and see what it’s all about. Plus, you know, it’s supporting indie developers.\n\nIt’s a fun project, you should check it out. Here’s my profile - [https://kq.omg.lol](https://kq.omg.lol)\n",
				"date_published": "2023-04-15T10:35:51+01:00",
				"url": "https://qrk.social/2023/04/15/ive-heard-lots.html"
			},
			{
				"id": "http://kq.micro.blog/2023/04/14/i-miss-likesfavouriteswhatevers.html",
				
				"content_html": "<p><strong>I miss likes/favourites/whatevers</strong></p>\n<p>I know Micro.blog purposely doesn’t have “likes” but I miss them. Not because I want to be silently praised by internet peeps, but because I want to <em>give</em> likes. I see them as a kind of silent feedback. Like if you’re in a pub talking and someone gives a knowing nod, or a smile.</p>\n<p>I want to be able to give the virtual equivalent of that silent nod. That passive appreciation for what I just read.</p>\n<p>Likes are silent communication and I miss them. Not everything requires a reply…</p>\n",
				"content_text": "**I miss likes/favourites/whatevers**\n\nI know Micro.blog purposely doesn’t have “likes” but I miss them. Not because I want to be silently praised by internet peeps, but because I want to _give_ likes. I see them as a kind of silent feedback. Like if you’re in a pub talking and someone gives a knowing nod, or a smile.\n\nI want to be able to give the virtual equivalent of that silent nod. That passive appreciation for what I just read.\n\nLikes are silent communication and I miss them. Not everything requires a reply…\n",
				"date_published": "2023-04-14T22:31:54+01:00",
				"url": "https://qrk.social/2023/04/14/i-miss-likesfavouriteswhatevers.html"
			},
			{
				"id": "http://kq.micro.blog/2023/04/14/high-praise-indeed.html",
				
				"content_html": "<p>High praise indeed when blogging royalty links to your post, ey <a href=\"https://micro.blog/manton\">@manton</a> 😊</p>\n<blockquote>\n<p>Perhaps it&rsquo;s helpful to think of Elon Musk as an accelerant for all the bad stuff that was slowly happening at Twitter before he got there. &ldquo;In the long run we will be thankful that Elon is effectively putting the company out of its misery.&rdquo;</p>\n</blockquote>\n<p><a href=\"https://kottke.org/quick-links/\">https://kottke.org/quick-links/</a></p>\n",
				"content_text": "High praise indeed when blogging royalty links to your post, ey [@manton](https://micro.blog/manton) 😊\n\n> Perhaps it's helpful to think of Elon Musk as an accelerant for all the bad stuff that was slowly happening at Twitter before he got there. \"In the long run we will be thankful that Elon is effectively putting the company out of its misery.\"\n\n[https://kottke.org/quick-links/](https://kottke.org/quick-links/)\n",
				"date_published": "2023-04-14T22:23:12+01:00",
				"url": "https://qrk.social/2023/04/14/high-praise-indeed.html"
			},
			{
				"id": "http://kq.micro.blog/2023/04/13/so-far-im.html",
				
				"content_html": "<p>So far I’m <strong>incredibly</strong> impressed with <a href=\"https://blot.im\">Blot</a>. The service has all the advantages of an SSG with none of the hassle. The support by the creator, David, is also superbly good.</p>\n<p>99.9% sure I’m gonna migrate from Jekyll at this point.</p>\n",
				"content_text": "So far I’m **incredibly** impressed with [Blot](https://blot.im). The service has all the advantages of an SSG with none of the hassle. The support by the creator, David, is also superbly good.\n\n99.9% sure I’m gonna migrate from Jekyll at this point.\n",
				"date_published": "2023-04-13T17:10:36+01:00",
				"url": "https://qrk.social/2023/04/13/so-far-im.html"
			},
			{
				"id": "http://kq.micro.blog/2023/04/11/heres-a-question.html",
				
				"content_html": "<p>⁉️ Here’s a question for you fine people…</p>\n<p>If you’re visiting someone’s blog, do you ever check out the categories/tags of their posts, or don’t you care?</p>\n<p>I don’t think I can recall a single time that I’ve used cats/tags one someone’s blog, especially if they have a search box.</p>\n<p>Is that just me?</p>\n",
				"content_text": "⁉️ Here’s a question for you fine people…\n\nIf you’re visiting someone’s blog, do you ever check out the categories/tags of their posts, or don’t you care?\n\nI don’t think I can recall a single time that I’ve used cats/tags one someone’s blog, especially if they have a search box.\n\nIs that just me?\n",
				"date_published": "2023-04-11T23:05:54+01:00",
				"url": "https://qrk.social/2023/04/11/heres-a-question.html"
			},
			{
				"id": "http://kq.micro.blog/2023/04/11/had-the-day.html",
				
				"content_html": "<p>Had the day off work today, so managed to spend a couple hours playing with <a href=\"https://blot.im\">Blot</a>. There’s still a lot to do if I’m actually going to use this thing, but I’m surprised at how easy it is to pickup.</p>\n<p>My dev site on Blot already looks similar to my Jekyll site:</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Had the day off work today, so managed to spend a couple hours playing with [Blot](https://blot.im). There’s still a lot to do if I’m actually going to use this thing, but I’m surprised at how easy it is to pickup.\n\nMy dev site on Blot already looks similar to my Jekyll site:\n\n<img src=\"uploads/2023/44f8a7bcdc.jpg\" width=\"600\" height=\"600\" alt=\"\">\n",
				"date_published": "2023-04-11T22:51:45+01:00",
				"url": "https://qrk.social/2023/04/11/had-the-day.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/04/10/wife-and-i.html",
				
				"content_html": "<p>Wife and I just finished watching Tetris. It was really good - highly recommended.</p>\n",
				"content_text": "Wife and I just finished watching Tetris. It was really good - highly recommended.\n",
				"date_published": "2023-04-10T22:52:18+01:00",
				"url": "https://qrk.social/2023/04/10/wife-and-i.html"
			},
			{
				"id": "http://kq.micro.blog/2023/04/10/is-good-enoughgood.html",
				
				"content_html": "<p>🔗 <a href=\"https://kevquirk.com/is-good-enough-good-enough/\">Is Good Enough&hellip;Good Enough?</a></p>\n<p>This is something I&rsquo;ve been ruminating on recently, whilst going down the familiar &ldquo;is my current blog platform the right one?&rdquo; rabbit hole.</p>\n",
				"content_text": "🔗 [Is Good Enough...Good Enough?](https://kevquirk.com/is-good-enough-good-enough/)\n\nThis is something I've been ruminating on recently, whilst going down the familiar \"is my current blog platform the right one?\" rabbit hole.\n",
				"date_published": "2023-04-10T17:24:55+01:00",
				"url": "https://qrk.social/2023/04/10/is-good-enoughgood.html",
				"tags": ["Links"]
			},
			{
				"id": "http://kq.micro.blog/2023/04/10/im-going-down.html",
				
				"content_html": "<p>I&rsquo;m going down a platform rabbit hole (again!) and I don&rsquo;t know what to do&hellip;<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/is-good-enough-good-enough\">https://kevquirk.com/is-good-enough-good-enough</a><!-- raw HTML omitted --></p>\n",
				"content_text": "I'm going down a platform rabbit hole (again!) and I don't know what to do...   \r\n                <br><a href=\"https://kevquirk.com/is-good-enough-good-enough\">https://kevquirk.com/is-good-enough-good-enough</a>\n",
				"date_published": "2023-04-10T17:20:00+01:00",
				"url": "https://qrk.social/2023/04/10/im-going-down.html"
			},
			{
				"id": "http://kq.micro.blog/2023/04/10/took-the-cover.html",
				
				"content_html": "<p>Took the cover off one of my Motorbikes to do some maintenance on it (haven’t ridden it for around a month) and this is what I found. 😳</p>\n<p>I really think I need to do some work on insulating the garage this summer!</p>\n<p>🏍️</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "Took the cover off one of my Motorbikes to do some maintenance on it (haven’t ridden it for around a month) and this is what I found. 😳\n\nI really think I need to do some work on insulating the garage this summer!\n\n🏍️\n\n<img src=\"uploads/2023/77b64a59fe.jpg\" width=\"600\" height=\"600\" alt=\"\"><img src=\"uploads/2023/4ceabf28ce.jpg\" width=\"600\" height=\"600\" alt=\"\"><img src=\"uploads/2023/b168817f23.jpg\" width=\"600\" height=\"600\" alt=\"\">\n",
				"date_published": "2023-04-10T15:44:54+01:00",
				"url": "https://qrk.social/2023/04/10/took-the-cover.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/04/10/nice-family-walk.html",
				
				"content_html": "<p>Nice family walk today. We did a little over 7km in the Welsh (hilly) countryside. Particularly impressed with my 5 year old. We got home just as the heavens opened too, so didn’t get too wet.</p>\n<p>Now it’s time for cups of tea and bacon bagels! 🥯 👨‍👩‍👦‍👦 🐾 📸</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "Nice family walk today. We did a little over 7km in the Welsh (hilly) countryside. Particularly impressed with my 5 year old. We got home just as the heavens opened too, so didn’t get too wet.\n\nNow it’s time for cups of tea and bacon bagels! 🥯 👨‍👩‍👦‍👦 🐾 📸\n\n<img src=\"uploads/2023/5ef9227141.jpg\" width=\"600\" height=\"600\" alt=\"\"><img src=\"uploads/2023/a4c2604bf3.jpg\" width=\"600\" height=\"450\" alt=\"\"><img src=\"uploads/2023/9c97d5f8ea.jpg\" width=\"600\" height=\"600\" alt=\"\">\n",
				"date_published": "2023-04-10T12:25:53+01:00",
				"url": "https://qrk.social/2023/04/10/nice-family-walk.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/04/10/after-my-brief.html",
				
				"content_html": "<p>After my brief foray into self-hosting a Microblog (via Wordpress) I decided it would be easier to let <a href=\"https://micro.blog/manton\">@manton</a> and the team worry about plugging the <strong>many</strong> parts together, so I can just enjoy the community.</p>\n<p>So, I’m very happy to be back here on Micro.blog. 😊</p>\n",
				"content_text": "After my brief foray into self-hosting a Microblog (via Wordpress) I decided it would be easier to let [@manton](https://micro.blog/manton) and the team worry about plugging the **many** parts together, so I can just enjoy the community.\n\nSo, I’m very happy to be back here on Micro.blog. 😊 \n",
				"date_published": "2023-04-10T08:21:21+01:00",
				"url": "https://qrk.social/2023/04/10/after-my-brief.html"
			},
			{
				"id": "http://kq.micro.blog/2023/04/09/unfortunately-davatronmastodonsocial-sadly.html",
				
				"content_html": "<p>Unfortunately, <a href=\"https://micro.blog/davatron5000@mastodon.social\">@davatron5000@mastodon.social</a> sadly lost his dog, <a href=\"https://daverupert.com/2023/04/goodbye-rudy/\">Rudy</a>. This post brought a tear to my eye, especially since I’m a fellow dog owner with an old girl too.</p>\n<p>I’m so so sorry for your loss, Dave.</p>\n",
				"content_text": "Unfortunately, [@davatron5000@mastodon.social](https://micro.blog/davatron5000@mastodon.social) sadly lost his dog, [Rudy](https://daverupert.com/2023/04/goodbye-rudy/). This post brought a tear to my eye, especially since I’m a fellow dog owner with an old girl too.\n\nI’m so so sorry for your loss, Dave.\n",
				"date_published": "2023-04-09T07:36:21+01:00",
				"url": "https://qrk.social/2023/04/09/unfortunately-davatronmastodonsocial-sadly.html"
			},
			{
				"id": "http://kq.micro.blog/2023/04/08/has-the-colour.html",
				
				"content_html": "<p>Has the colour of the text in dark mode on the Microblog iOS app changed? It’s seems less harsh on my eyes. If it has, thanks, <a href=\"https://micro.blog/manton\">@manton</a>.</p>\n",
				"content_text": "Has the colour of the text in dark mode on the Microblog iOS app changed? It’s seems less harsh on my eyes. If it has, thanks, [@manton](https://micro.blog/manton).\n",
				"date_published": "2023-04-08T21:56:27+01:00",
				"url": "https://qrk.social/2023/04/08/has-the-colour.html"
			},
			{
				"id": "http://kq.micro.blog/2023/04/08/today-was-a.html",
				
				"content_html": "<p>Today was a beautiful day, so decided to get out for a few hours on one of the Motorbikes. Really glad I did – it’s good for the soul!</p>\n",
				"content_text": "Today was a beautiful day, so decided to get out for a few hours on one of the Motorbikes. Really glad I did – it’s good for the soul!\n",
				"date_published": "2023-04-08T18:36:00+01:00",
				"url": "https://qrk.social/2023/04/08/today-was-a.html"
			},
			{
				"id": "http://kq.micro.blog/2023/04/07/lovely-walk-in.html",
				
				"content_html": "<p>Lovely walk in the wood behind our house this evening.</p>\n<p><img src=\"https://qrk.social/uploads/2023/b7a4ee8682.jpg\" alt=\"\"></p>\n",
				"content_text": "Lovely walk in the wood behind our house this evening.\n\n![](https://qrk.social/uploads/2023/b7a4ee8682.jpg)\n",
				"date_published": "2023-04-07T20:23:00+01:00",
				"url": "https://qrk.social/2023/04/07/lovely-walk-in.html"
			},
			{
				"id": "http://kq.micro.blog/2023/04/06/let-people-contact.html",
				
				"content_html": "<p>🔗 <a href=\"https://manuelmoreale.com/let-people-contact-you\">Let people contact you</a> by Manu</p>\n<p>I really enjoy Manu’s blog and this post is no exception. Yep. If you have a blog, give readers a way of contacting you that isn’t social media. Please.</p>\n",
				"content_text": "🔗 [Let people contact you](https://manuelmoreale.com/let-people-contact-you) by Manu \n\nI really enjoy Manu’s blog and this post is no exception. Yep. If you have a blog, give readers a way of contacting you that isn’t social media. Please.\n",
				"date_published": "2023-04-06T22:43:00+01:00",
				"url": "https://qrk.social/2023/04/06/let-people-contact.html",
				"tags": ["Links"]
			},
			{
				"id": "http://kq.micro.blog/2023/04/06/ive-been-struggling.html",
				
				"content_html": "<p>I&rsquo;ve been struggling with Micro.blog&rsquo;s offering for a little while, so I decided to build my own microblog.<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/self-hosted-microblog\">https://kevquirk.com/self-hosted-microblog</a><!-- raw HTML omitted --></p>\n",
				"content_text": "I've been struggling with Micro.blog's offering for a little while, so I decided to build my own microblog.   \r\n                <br><a href=\"https://kevquirk.com/self-hosted-microblog\">https://kevquirk.com/self-hosted-microblog</a>\n",
				"date_published": "2023-04-06T17:02:00+01:00",
				"url": "https://qrk.social/2023/04/06/ive-been-struggling.html"
			},
			{
				"id": "http://kq.micro.blog/2023/04/02/one-of-my.html",
				
				"content_html": "<p>One of my sons really enjoys drawing, and he decided he wanted to draw one of my watches. He chose the cheapest watch in my collection, one of my Casio F-91W.</p>\n<p>He drew that, then asked to draw another, of course he chose the most expensive watch in my collection. 😳</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "One of my sons really enjoys drawing, and he decided he wanted to draw one of my watches. He chose the cheapest watch in my collection, one of my Casio F-91W.\n\nHe drew that, then asked to draw another, of course he chose the most expensive watch in my collection. 😳\n\n<img src=\"uploads/2023/840da10dce.jpg\" width=\"600\" height=\"354\" alt=\"\">\n",
				"date_published": "2023-04-02T10:22:52+01:00",
				"url": "https://qrk.social/2023/04/02/one-of-my.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/04/01/are-there-any.html",
				
				"content_html": "<p>Are there any other people here who manage their blog and microblog separately? I’m still trying to work out what that’s gonna look like long term, but I have no plans to fold my main blog into Micro.blog.</p>\n<p>If you keep them separate, what’s that workflow look like for you?</p>\n",
				"content_text": "Are there any other people here who manage their blog and microblog separately? I’m still trying to work out what that’s gonna look like long term, but I have no plans to fold my main blog into Micro.blog.\n\nIf you keep them separate, what’s that workflow look like for you?\n",
				"date_published": "2023-04-01T22:29:33+01:00",
				"url": "https://qrk.social/2023/04/01/are-there-any.html"
			},
			{
				"id": "http://kq.micro.blog/2023/04/01/onemanandhisblogcom-does-it.html",
				
				"content_html": "<p><a href=\"https://onemanandhisblog.com/2023/03/does-it-matter-is-substack-is-in-trouble/\">onemanandhisblog.com</a></p>\n<blockquote>\n<p>Does it matter if Substack is in financial trouble?</p>\n</blockquote>\n<p>Really interesting post by <a href=\"https://micro.blog/adders\">@adders</a> about the potential demise of Substack. I know a couple of people who have made Substack their home on the web. It might be time to start looking for alternatives, folks. 😞</p>\n",
				"content_text": " [onemanandhisblog.com](https://onemanandhisblog.com/2023/03/does-it-matter-is-substack-is-in-trouble/)\n\n> Does it matter if Substack is in financial trouble?\n\nReally interesting post by [@adders](https://micro.blog/adders) about the potential demise of Substack. I know a couple of people who have made Substack their home on the web. It might be time to start looking for alternatives, folks. 😞\n",
				"date_published": "2023-04-01T22:16:39+01:00",
				"url": "https://qrk.social/2023/04/01/onemanandhisblogcom-does-it.html"
			},
			{
				"id": "http://kq.micro.blog/2023/03/31/ive-been-making.html",
				
				"content_html": "<p>I&rsquo;ve been making some changes to my site over the last couple days, and I just published them. I&rsquo;ve added some splashes of colour around the joint, and I&rsquo;ve also made the about page a little more fun.</p>\n<p>Check it out if you&rsquo;re interested: <a href=\"https://kevquirk.com/about/\">https://kevquirk.com/about</a></p>\n",
				"content_text": "I've been making some changes to my site over the last couple days, and I just published them. I've added some splashes of colour around the joint, and I've also made the about page a little more fun.\r\n\r\nCheck it out if you're interested: [https://kevquirk.com/about](https://kevquirk.com/about/)\r\n",
				"date_published": "2023-03-31T17:13:34+01:00",
				"url": "https://qrk.social/2023/03/31/ive-been-making.html"
			},
			{
				"id": "http://kq.micro.blog/2023/03/31/treated-myself-to.html",
				
				"content_html": "<p>Treated myself to a new watch. This is my first Swiss automatic and I’m really thrilled with it. It’s a beautiful thing.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Treated myself to a new watch. This is my first Swiss automatic and I’m really thrilled with it. It’s a beautiful thing.\n\n<img src=\"uploads/2023/7124d69c16.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-03-31T11:02:53+01:00",
				"url": "https://qrk.social/2023/03/31/treated-myself-to.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/03/30/for-hobbyists-or.html",
				
				"content_html": "<blockquote>\n<p>For hobbyists or <strong>students</strong> learning to code.</p>\n</blockquote>\n<p>Yup, because students have $100/month to spare! 😂</p>\n<p><a href=\"https://twittercommunity.com/t/announcing-new-access-tiers-for-the-twitter-api/188728\">twittercommunity.com/t/announc&hellip;</a></p>\n",
				"content_text": "> For hobbyists or **students** learning to code.\n\nYup, because students have $100/month to spare! 😂\n\n[twittercommunity.com/t/announc...](https://twittercommunity.com/t/announcing-new-access-tiers-for-the-twitter-api/188728)\n",
				"date_published": "2023-03-30T20:03:22+01:00",
				"url": "https://qrk.social/2023/03/30/for-hobbyists-or.html"
			},
			{
				"id": "http://kq.micro.blog/2023/03/29/ive-just-been.html",
				
				"content_html": "<p>I’ve just been looking at the Apple passwords feature, since lots of people are talking about it at the moment (I’m a Bitwarden user) and it looks very good. I don’t think I’d use it though. I like the idea of having something like my passwords on its own service. Apple already have enough of my data, they don’t need passwords too.</p>\n",
				"content_text": "I’ve just been looking at the Apple passwords feature, since lots of people are talking about it at the moment (I’m a Bitwarden user) and it looks very good. I don’t think I’d use it though. I like the idea of having something like my passwords on its own service. Apple already have enough of my data, they don’t need passwords too.\n",
				"date_published": "2023-03-29T07:29:39+01:00",
				"url": "https://qrk.social/2023/03/29/ive-just-been.html"
			},
			{
				"id": "http://kq.micro.blog/2023/03/26/something-a-bit.html",
				
				"content_html": "<p>Something a bit different today - a book 📚 recommendation for those parents out there.</p>\n<p>Astrosaurs is a great series of book by Steve Cole.</p>\n<p><a href=\"https://kevquirk.com/astrosaurs/\">kevquirk.com/astrosaur&hellip;</a></p>\n",
				"content_text": "Something a bit different today - a book 📚 recommendation for those parents out there.\r\n\r\nAstrosaurs is a great series of book by Steve Cole.\r\n\r\n[kevquirk.com/astrosaur...](https://kevquirk.com/astrosaurs/)\r\n",
				"date_published": "2023-03-26T12:34:03+01:00",
				"url": "https://qrk.social/2023/03/26/something-a-bit.html",
				"tags": ["Books"]
			},
			{
				"id": "http://kq.micro.blog/2023/03/26/astrosaurs-is-a.html",
				
				"content_html": "<p>Astrosaurs is a fantastic series of books for kids. You should definitely check it out.<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/astrosaurs\">https://kevquirk.com/astrosaurs</a><!-- raw HTML omitted --></p>\n",
				"content_text": "Astrosaurs is a fantastic series of books for kids. You should definitely check it out.   \r\n                <br><a href=\"https://kevquirk.com/astrosaurs\">https://kevquirk.com/astrosaurs</a>\n",
				"date_published": "2023-03-26T12:12:00+01:00",
				"url": "https://qrk.social/2023/03/26/astrosaurs-is-a.html"
			},
			{
				"id": "http://kq.micro.blog/2023/03/26/you-know-what.html",
				
				"content_html": "<p>You know what the worst thing is about collecting watches? The 2x a year when the clocks change. Changing the time by 1hr on 50 watch is <strong>NOT</strong> fun. 😂</p>\n",
				"content_text": "You know what the worst thing is about collecting watches? The 2x a year when the clocks change. Changing the time by 1hr on 50 watch is **NOT** fun. 😂\n",
				"date_published": "2023-03-26T12:08:07+01:00",
				"url": "https://qrk.social/2023/03/26/you-know-what.html",
				"tags": ["Watches"]
			},
			{
				"id": "http://kq.micro.blog/2023/03/25/does-anyone-else.html",
				
				"content_html": "<p>Does anyone else have an entire box of watch straps, like this?</p>\n<p>…no? Just me then. 😳</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Does anyone else have an entire box of watch straps, like this?\n\n…no? Just me then. 😳\n\n<img src=\"uploads/2023/7e3cf16691.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-03-25T11:38:13+01:00",
				"url": "https://qrk.social/2023/03/25/does-anyone-else.html",
				"tags": ["Watches","Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/03/24/some-wont-like.html",
				
				"content_html": "<p>Some won&rsquo;t like, but I&rsquo;ve decided to re-join Twitter.</p>\n<p><a href=\"https://kevquirk.com/rejoined-twitter/\">kevquirk.com/rejoined-&hellip;</a></p>\n",
				"content_text": "Some won't like, but I've decided to re-join Twitter.\r\n\r\n[kevquirk.com/rejoined-...](https://kevquirk.com/rejoined-twitter/)\r\n",
				"date_published": "2023-03-24T16:46:54+01:00",
				"url": "https://qrk.social/2023/03/24/some-wont-like.html"
			},
			{
				"id": "http://kq.micro.blog/2023/03/24/ive-decided-to.html",
				
				"content_html": "<p>I&rsquo;ve decided to re-join Twitter. I miss an awful lot about it and I might leave Mastodon too.<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/rejoined-twitter\">https://kevquirk.com/rejoined-twitter</a><!-- raw HTML omitted --></p>\n",
				"content_text": "I've decided to re-join Twitter. I miss an awful lot about it and I might leave Mastodon too.   \r\n                <br><a href=\"https://kevquirk.com/rejoined-twitter\">https://kevquirk.com/rejoined-twitter</a>\n",
				"date_published": "2023-03-24T16:43:00+01:00",
				"url": "https://qrk.social/2023/03/24/ive-decided-to.html"
			},
			{
				"id": "http://kq.micro.blog/2023/03/24/in-this-interesting.html",
				
				"content_html": "<p>In this interesting post, Garrit talks about why he wouldn&rsquo;t buy a YubiKey and I get where he&rsquo;s coming from.<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/i-wont-by-a-yubikey\">https://kevquirk.com/i-wont-by-a-yubikey</a><!-- raw HTML omitted --></p>\n",
				"content_text": "In this interesting post, Garrit talks about why he wouldn't buy a YubiKey and I get where he's coming from.   \r\n                <br><a href=\"https://kevquirk.com/i-wont-by-a-yubikey\">https://kevquirk.com/i-wont-by-a-yubikey</a>\n",
				"date_published": "2023-03-24T15:02:00+01:00",
				"url": "https://qrk.social/2023/03/24/in-this-interesting.html"
			},
			{
				"id": "http://kq.micro.blog/2023/03/24/ive-started-wearing.html",
				
				"content_html": "<p>I&rsquo;ve started wearing a fitness tracker (a Garmin Vivosmart 5, to be more accurate), but I already wear a traditional watch. So I have a watch on one wrist and the tracker on the other. It&rsquo;s weird, but I&rsquo;m getting used to it.</p>\n",
				"content_text": "I've started wearing a fitness tracker (a Garmin Vivosmart 5, to be more accurate), but I already wear a traditional watch. So I have a watch on one wrist and the tracker on the other. It's weird, but I'm getting used to it.\n",
				"date_published": "2023-03-24T09:35:52+01:00",
				"url": "https://qrk.social/2023/03/24/ive-started-wearing.html"
			},
			{
				"id": "http://kq.micro.blog/2023/03/21/some-really-interesting.html",
				
				"content_html": "<p>Some really interesting calculations from Manu here in response to <a href=\"https://micro.blog/tdarb@fosstodon.org\">@tdarb@fosstodon.org</a> post. It’s a <strong>very</strong> compelling argument and now I’m thinking about removing my custom font…</p>\n<p><a href=\"https://manuelmoreale.com/bandwidth-consumption\">manuelmoreale.com/bandwidth&hellip;</a></p>\n",
				"content_text": "Some really interesting calculations from Manu here in response to [@tdarb@fosstodon.org](https://micro.blog/tdarb@fosstodon.org) post. It’s a **very** compelling argument and now I’m thinking about removing my custom font…\n\n[manuelmoreale.com/bandwidth...](https://manuelmoreale.com/bandwidth-consumption)\n",
				"date_published": "2023-03-22T00:36:29+01:00",
				"url": "https://qrk.social/2023/03/21/some-really-interesting.html"
			},
			{
				"id": "http://kq.micro.blog/2023/03/21/i-have-been.html",
				
				"content_html": "<p>I have been thinking about having a backup account on the Fediverse, but I’m struggling with which service to use.<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/fediverse-backup\">https://kevquirk.com/fediverse-backup</a><!-- raw HTML omitted --></p>\n",
				"content_text": "I have been thinking about having a backup account on the Fediverse, but I&#x2019;m struggling with which service to use.   \r\n                <br><a href=\"https://kevquirk.com/fediverse-backup\">https://kevquirk.com/fediverse-backup</a>\n",
				"date_published": "2023-03-21T23:58:00+01:00",
				"url": "https://qrk.social/2023/03/21/i-have-been.html"
			},
			{
				"id": "http://kq.micro.blog/2023/03/21/are-all-the.html",
				
				"content_html": "<p>Are all the timelines etc. blank for anyone else on the Micro.blog app?</p>\n",
				"content_text": "Are all the timelines etc. blank for anyone else on the Micro.blog app?\n",
				"date_published": "2023-03-21T19:53:12+01:00",
				"url": "https://qrk.social/2023/03/21/are-all-the.html"
			},
			{
				"id": "http://kq.micro.blog/2023/03/20/should-content-on.html",
				
				"content_html": "<p>Should content on a personal site be edited, or should it be a snapshot in time?<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/thoughts-on-editing-posts\">https://kevquirk.com/thoughts-on-editing-posts</a><!-- raw HTML omitted --></p>\n",
				"content_text": "Should content on a personal site be edited, or should it be a snapshot in time?   \r\n                <br><a href=\"https://kevquirk.com/thoughts-on-editing-posts\">https://kevquirk.com/thoughts-on-editing-posts</a>\n",
				"date_published": "2023-03-20T12:53:00+01:00",
				"url": "https://qrk.social/2023/03/20/should-content-on.html"
			},
			{
				"id": "http://kq.micro.blog/2023/03/19/i-dont-get.html",
				
				"content_html": "<p>I don’t get it; what’s the difference between a digital garden and a blog? 🤷‍♂️</p>\n",
				"content_text": "I don’t get it; what’s the difference between a digital garden and a blog? 🤷‍♂️\n",
				"date_published": "2023-03-19T23:47:30+01:00",
				"url": "https://qrk.social/2023/03/19/i-dont-get.html"
			},
			{
				"id": "http://kq.micro.blog/2023/03/19/anyone-know-how.html",
				
				"content_html": "<p>Anyone know how I go about discovering a new fediverse account here on Micro.blog please? I’m trying to follow <a href=\"https://micro.blog/torvalds@social.kernel.org\">@torvalds@social.kernel.org</a> but he’s not appearing in any results.</p>\n<p>Hey, Linus!</p>\n",
				"content_text": "Anyone know how I go about discovering a new fediverse account here on Micro.blog please? I’m trying to follow [@torvalds@social.kernel.org](https://micro.blog/torvalds@social.kernel.org) but he’s not appearing in any results.\n\nHey, Linus!\n",
				"date_published": "2023-03-19T23:29:44+01:00",
				"url": "https://qrk.social/2023/03/19/anyone-know-how.html"
			},
			{
				"id": "http://kq.micro.blog/2023/03/19/one-of-my.html",
				
				"content_html": "<p>One of my favourite things to do on a Sunday…spannering on the bikes. Today is a wheel bearing change.</p>\n<p>🔧 + 🏍️ = 👍</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "One of my favourite things to do on a Sunday…spannering on the bikes. Today is a wheel bearing change.\n\n🔧 + 🏍️ = 👍\n\n<img src=\"uploads/2023/ea80d169fe.jpg\" width=\"600\" height=\"600\" alt=\"\"><img src=\"uploads/2023/34e4552a3f.jpg\" width=\"600\" height=\"600\" alt=\"\">\n",
				"date_published": "2023-03-19T12:43:57+01:00",
				"url": "https://qrk.social/2023/03/19/one-of-my.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/03/18/since-moving-house.html",
				
				"content_html": "<p>Since moving house back in October, it feels like all we’ve been doing is haemorrhaging money…around £40,000 so far to be exact!</p>\n<p>We’re starting to see some progress now though, and I have to say, I’m very glad we moved. 😊</p>\n",
				"content_text": "Since moving house back in October, it feels like all we’ve been doing is haemorrhaging money…around £40,000 so far to be exact!\n\nWe’re starting to see some progress now though, and I have to say, I’m very glad we moved. 😊 \n",
				"date_published": "2023-03-18T21:25:11+01:00",
				"url": "https://qrk.social/2023/03/18/since-moving-house.html"
			},
			{
				"id": "http://kq.micro.blog/2023/03/16/analytics-discourage-creativity.html",
				
				"content_html": "<p><a href=\"https://bookishnoelle.linefeed.app/analytics-discourage-creativity-27cc8b\">Analytics Discourage Creativity</a> by <a href=\"https://mstdn.social/@noellemitchell\">@noellemitchell@mstdn.social</a></p>\n<p>I really feel this post and have <a href=\"https://kevquirk.com/revisiting-the-web-analytics-rabbit-hole/\">been down this rabbit hole myself</a>.</p>\n<p>BTW, I’m reading your blog, Noelle…hi! 👋</p>\n",
				"content_text": "[Analytics Discourage Creativity](https://bookishnoelle.linefeed.app/analytics-discourage-creativity-27cc8b) by [@noellemitchell@mstdn.social](https://mstdn.social/@noellemitchell)\n\nI really feel this post and have [been down this rabbit hole myself](https://kevquirk.com/revisiting-the-web-analytics-rabbit-hole/).\n\nBTW, I’m reading your blog, Noelle…hi! 👋\n",
				"date_published": "2023-03-16T23:41:57+01:00",
				"url": "https://qrk.social/2023/03/16/analytics-discourage-creativity.html"
			},
			{
				"id": "http://kq.micro.blog/2023/03/15/jason-kottke-celebrated.html",
				
				"content_html": "<p><a href=\"https://kottke.org/23/03/kottke-is-25-years-old-today\">Jason Kottke celebrated 25 years of blogging yesterday</a> that’s just incredible to me.</p>\n<p>Incidentally, I celebrated <a href=\"https://kevquirk.com/ten-years-of-blogging/\">10 years of blogging</a> myself recently.</p>\n<p>Hurray for the personal blog! 🎉</p>\n",
				"content_text": "[Jason Kottke celebrated 25 years of blogging yesterday](https://kottke.org/23/03/kottke-is-25-years-old-today) that’s just incredible to me.\n\nIncidentally, I celebrated [10 years of blogging](https://kevquirk.com/ten-years-of-blogging/) myself recently.\n\nHurray for the personal blog! 🎉\n",
				"date_published": "2023-03-15T23:39:24+01:00",
				"url": "https://qrk.social/2023/03/15/jason-kottke-celebrated.html"
			},
			{
				"id": "http://kq.micro.blog/2023/03/14/btht-stop-using.html",
				
				"content_html": "<p><a href=\"https://bt.ht/webfonts\">bt.ht</a></p>\n<blockquote>\n<p>Stop Using Custom Web Fonts</p>\n</blockquote>\n<p>I’m not sure I agree with Brad here. Well, for the most part I do, but I have a font on my site, and I use it because I really like how it looks. That all, that’s the reason. 😊</p>\n<p>I’ve also had a few people comment about the font, so <em>some</em> people clearly do appreciate custom fonts. Agree though, performance still needs to be a key factor.</p>\n",
				"content_text": " [bt.ht](https://bt.ht/webfonts)\n\n> Stop Using Custom Web Fonts\n\nI’m not sure I agree with Brad here. Well, for the most part I do, but I have a font on my site, and I use it because I really like how it looks. That all, that’s the reason. 😊\n\nI’ve also had a few people comment about the font, so *some* people clearly do appreciate custom fonts. Agree though, performance still needs to be a key factor.\n",
				"date_published": "2023-03-14T23:44:44+01:00",
				"url": "https://qrk.social/2023/03/14/btht-stop-using.html"
			},
			{
				"id": "http://kq.micro.blog/2023/03/13/i-hear-a.html",
				
				"content_html": "<p>I hear a lot of Americans saying “I went for a hike today…” in posts that are accompanied by often beautiful pictures of the US vast and varied landscape.</p>\n<p>But what is “a hike” to your average American? Because to me (British), a hike is a 20 mile hike up a large hill/mountain. Is it the same?</p>\n",
				"content_text": "I hear a lot of Americans saying “I went for a hike today…” in posts that are accompanied by often beautiful pictures of the US vast and varied landscape.\n\nBut what is “a hike” to your average American? Because to me (British), a hike is a 20 mile hike up a large hill/mountain. Is it the same?\n",
				"date_published": "2023-03-13T08:18:43+01:00",
				"url": "https://qrk.social/2023/03/13/i-hear-a.html"
			},
			{
				"id": "http://kq.micro.blog/2023/03/12/sledging-with-the.html",
				
				"content_html": "<p>Sledging with the kids…that sky! 🛷</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Sledging with the kids…that sky! 🛷\n\n<img src=\"uploads/2023/3f7c7221ea.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-03-12T14:52:53+01:00",
				"url": "https://qrk.social/2023/03/12/sledging-with-the.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/03/12/this-makes-me.html",
				
				"content_html": "<p>This makes me sad and very worried.</p>\n<p><a href=\"https://m.youtube.com/watch?v=LFGbWGMsuVY\">m.youtube.com/watch</a></p>\n",
				"content_text": "This makes me sad and very worried.\n\n[m.youtube.com/watch](https://m.youtube.com/watch?v=LFGbWGMsuVY)\n",
				"date_published": "2023-03-12T08:04:35+01:00",
				"url": "https://qrk.social/2023/03/12/this-makes-me.html"
			},
			{
				"id": "http://kq.micro.blog/2023/03/11/so-i-did.html",
				
				"content_html": "<p>So I did an <a href=\"https://www.skxmod.com\">SKXMOD</a> on my #Casio AE1200. Metal case, sapphire crystal and a silicone strap. Really happy with it! ⌚️</p>\n<p>(Bronze is before, black/silver is after)</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "So I did an [SKXMOD](https://www.skxmod.com) on my #Casio AE1200. Metal case, sapphire crystal and a silicone strap. Really happy with it! ⌚️\n\n(Bronze is before, black/silver is after) \n\n<img src=\"uploads/2023/74c2079c0f.jpg\" width=\"600\" height=\"450\" alt=\"\"><img src=\"uploads/2023/c02ff7be7a.jpg\" width=\"600\" height=\"450\" alt=\"\"><img src=\"uploads/2023/d197577b1b.jpg\" width=\"600\" height=\"450\" alt=\"\"><img src=\"uploads/2023/46155f38b8.jpg\" width=\"600\" height=\"450\" alt=\"\"><img src=\"uploads/2023/c6b5e3569c.jpg\" width=\"600\" height=\"450\" alt=\"\"><img src=\"uploads/2023/e75bbefb87.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-03-11T18:01:50+01:00",
				"url": "https://qrk.social/2023/03/11/so-i-did.html",
				"tags": ["Watches","Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/03/11/i-think-im.html",
				
				"content_html": "<p>I think I&rsquo;m good, thanks, Zoho.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "I think I'm good, thanks, Zoho.\n\n<img src=\"uploads/2023/1f5696e8dd.png\" width=\"600\" height=\"306\" alt=\"\">\n",
				"date_published": "2023-03-11T17:30:27+01:00",
				"url": "https://qrk.social/2023/03/11/i-think-im.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/03/11/this-is-a.html",
				
				"content_html": "<p>This is a list of design mistakes that I think too many blogs make. I&rsquo;ve made some of them myself over years, so I&rsquo;m speaking from experience here&hellip;<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/blog-design-mistakes\">https://kevquirk.com/blog-design-mistakes</a><!-- raw HTML omitted --></p>\n",
				"content_text": "This is a list of design mistakes that I think too many blogs make. I've made some of them myself over years, so I'm speaking from experience here...   \r\n                <br><a href=\"https://kevquirk.com/blog-design-mistakes\">https://kevquirk.com/blog-design-mistakes</a>\n",
				"date_published": "2023-03-11T11:21:00+01:00",
				"url": "https://qrk.social/2023/03/11/this-is-a.html"
			},
			{
				"id": "http://kq.micro.blog/2023/03/11/so-theres-a.html",
				
				"content_html": "<p>So there&rsquo;s a parody website that I came across a while back that is a demonstration of how bad the web in terms of popups, ads, modals etc. but I can&rsquo;t find the link right now. Would any of you fine people happen to know what it is please?</p>\n<p>Thanks!</p>\n",
				"content_text": "So there's a parody website that I came across a while back that is a demonstration of how bad the web in terms of popups, ads, modals etc. but I can't find the link right now. Would any of you fine people happen to know what it is please?\r\n\r\nThanks!\r\n",
				"date_published": "2023-03-11T10:35:34+01:00",
				"url": "https://qrk.social/2023/03/11/so-theres-a.html"
			},
			{
				"id": "http://kq.micro.blog/2023/03/10/how-is-it.html",
				
				"content_html": "<p>How is it that things can go from heavy snow to me practically getting sunburn in the space of a few hours??</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "How is it that things can go from heavy snow to me practically getting sunburn in the space of a few hours??\n\n<img src=\"uploads/2023/5677eb2f0e.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-03-10T15:13:05+01:00",
				"url": "https://qrk.social/2023/03/10/how-is-it.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/03/09/really-enjoyed-this.html",
				
				"content_html": "<p>Really enjoyed this post about a Minimal Viable Blog. I think it can be improved slightly though, so I’m gonna give it a go.</p>\n<p><a href=\"https://manuelmoreale.com/minimum-viable-blog\">manuelmoreale.com/minimum-v&hellip;</a></p>\n",
				"content_text": "Really enjoyed this post about a Minimal Viable Blog. I think it can be improved slightly though, so I’m gonna give it a go.\n\n[manuelmoreale.com/minimum-v...](https://manuelmoreale.com/minimum-viable-blog)\n",
				"date_published": "2023-03-09T22:56:09+01:00",
				"url": "https://qrk.social/2023/03/09/really-enjoyed-this.html"
			},
			{
				"id": "http://kq.micro.blog/2023/03/09/spring-has-sprungapparently.html",
				
				"content_html": "<p>Spring has sprung&hellip;apparently. 😳</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Spring has sprung...apparently. 😳\n\n<img src=\"uploads/2023/faadb46875.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-03-09T11:32:05+01:00",
				"url": "https://qrk.social/2023/03/09/spring-has-sprungapparently.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/03/09/daily-challenge-day.html",
				
				"content_html": "<p>Daily challenge day 9 - <strong>“together”</strong></p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Daily challenge day 9 - **“together”**\n\n<img src=\"uploads/2023/9f9042d236.jpg\" width=\"600\" height=\"600\" alt=\"\">\n",
				"date_published": "2023-03-09T07:48:11+01:00",
				"url": "https://qrk.social/2023/03/09/daily-challenge-day.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/03/08/photo-challenge-day.html",
				
				"content_html": "<p>Photo challenge day 8 - “walk”. Here’s a photo of the Welsh hills during a lovely walk with my wife recently…</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Photo challenge day 8 - “walk”. Here’s a photo of the Welsh hills during a lovely walk with my wife recently…\n\n<img src=\"uploads/2023/f235f31a33.jpg\" width=\"600\" height=\"600\" alt=\"\">\n",
				"date_published": "2023-03-08T07:16:28+01:00",
				"url": "https://qrk.social/2023/03/08/photo-challenge-day.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/03/07/love-this-bridge.html",
				
				"content_html": "<p>Love this bridge that isn’t far from my house. Good one for @challenge day 6 - “Engineering”.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Love this bridge that isn’t far from my house. Good one for @challenge day 6 - “Engineering”.\n\n<img src=\"uploads/2023/72f2d28d12.jpg\" width=\"450\" height=\"600\" alt=\"\">\n",
				"date_published": "2023-03-08T00:22:52+01:00",
				"url": "https://qrk.social/2023/03/07/love-this-bridge.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/03/07/a-whole-lot.html",
				
				"content_html": "<p>A WHOLE lot of stars. 📸</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "A WHOLE lot of stars. 📸\n\n<img src=\"uploads/2023/adde0c4d79.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-03-07T20:06:39+01:00",
				"url": "https://qrk.social/2023/03/07/a-whole-lot.html",
				"tags": ["Photos"]
			},
			{
				"id": "http://kq.micro.blog/2023/03/07/ok-ive-upgraded.html",
				
				"content_html": "<p>OK, I&rsquo;ve upgraded my account and I&rsquo;m giving this this a proper try. Hello, world!</p>\n",
				"content_text": "OK, I've upgraded my account and I'm giving this this a proper try. Hello, world!\n",
				"date_published": "2023-03-07T12:21:07+01:00",
				"url": "https://qrk.social/2023/03/07/ok-ive-upgraded.html"
			},
			{
				"id": "http://kq.micro.blog/2023/03/03/gideon-the-ninth.html",
				
				"content_html": "<p>Gideon The Ninth is the first book in Tamsyn Muir&rsquo;s &ldquo;The Locked Tomb &quot; series<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/gideon-the-ninth\">https://kevquirk.com/gideon-the-ninth</a><!-- raw HTML omitted --></p>\n",
				"content_text": "Gideon The Ninth is the first book in Tamsyn Muir's \"The Locked Tomb \" series   \r\n                <br><a href=\"https://kevquirk.com/gideon-the-ninth\">https://kevquirk.com/gideon-the-ninth</a>\n",
				"date_published": "2023-03-03T16:55:00+01:00",
				"url": "https://qrk.social/2023/03/03/gideon-the-ninth.html"
			},
			{
				"id": "http://kq.micro.blog/2023/02/28/i-have-added.html",
				
				"content_html": "<p>I have added a way for you to subscribe to this blog via email.<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/email-subscriptions\">https://kevquirk.com/email-subscriptions</a><!-- raw HTML omitted --></p>\n",
				"content_text": "I have added a way for you to subscribe to this blog via email.   \r\n                <br><a href=\"https://kevquirk.com/email-subscriptions\">https://kevquirk.com/email-subscriptions</a>\n",
				"date_published": "2023-02-28T17:01:00+01:00",
				"url": "https://qrk.social/2023/02/28/i-have-added.html"
			},
			{
				"id": "http://kq.micro.blog/2023/02/27/ive-managed-to.html",
				
				"content_html": "<p>I&rsquo;ve managed to come up with a static site workflow that I think is as good as WordPress. Here&rsquo;s the details&hellip;<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/my-static-site-workflow\">https://kevquirk.com/my-static-site-workflow</a><!-- raw HTML omitted --></p>\n",
				"content_text": "I've managed to come up with a static site workflow that I think is as good as WordPress. Here's the details...   \r\n                <br><a href=\"https://kevquirk.com/my-static-site-workflow\">https://kevquirk.com/my-static-site-workflow</a>\n",
				"date_published": "2023-02-27T19:12:00+01:00",
				"url": "https://qrk.social/2023/02/27/ive-managed-to.html"
			},
			{
				"id": "http://kq.micro.blog/2023/02/19/i-wanted-a.html",
				
				"content_html": "<p>I wanted a way to automate the git add, commit &amp; push commands. Here&rsquo;s how I did it&hellip;<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/null\">https://kevquirk.com/null</a><!-- raw HTML omitted --></p>\n",
				"content_text": "I wanted a way to automate the git add, commit & push commands. Here's how I did it...   \r\n                <br><a href=\"https://kevquirk.com/null\">https://kevquirk.com/null</a>\n",
				"date_published": "2023-02-19T11:20:00+01:00",
				"url": "https://qrk.social/2023/02/19/i-wanted-a.html"
			},
			{
				"id": "http://kq.micro.blog/2023/02/16/i-want-to.html",
				
				"content_html": "<p>I want to love Micro.Blog, I really do, but it&rsquo;s just so bloody confusing to use!<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/null-3\">https://kevquirk.com/null-3</a><!-- raw HTML omitted --></p>\n",
				"content_text": "I want to love Micro.Blog, I really do, but it's just so bloody confusing to use!   \r\n                <br><a href=\"https://kevquirk.com/null-3\">https://kevquirk.com/null-3</a>\n",
				"date_published": "2023-02-16T14:34:00+01:00",
				"url": "https://qrk.social/2023/02/16/i-want-to.html"
			},
			{
				"id": "http://kq.micro.blog/2023/02/10/the-wise-mans.html",
				
				"content_html": "<p>The Wise Man&rsquo;s Fear, book 2 in Patrick Rothfuss' Kingkiller Chronicle is fantastic<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/the-wise-mans-fear\">https://kevquirk.com/the-wise-mans-fear</a><!-- raw HTML omitted --></p>\n",
				"content_text": "The Wise Man's Fear, book 2 in Patrick Rothfuss' Kingkiller Chronicle is fantastic   \r\n                <br><a href=\"https://kevquirk.com/the-wise-mans-fear\">https://kevquirk.com/the-wise-mans-fear</a>\n",
				"date_published": "2023-02-10T12:41:00+01:00",
				"url": "https://qrk.social/2023/02/10/the-wise-mans.html"
			},
			{
				"id": "http://kq.micro.blog/2023/02/06/im-going-to.html",
				
				"content_html": "<p>I&rsquo;m going to be having some fun on the Fediverse over the next few days/weeks. Please join in.<br>\n<!-- raw HTML omitted --><!-- raw HTML omitted --><a href=\"https://kevquirk.com/fedipoll\">https://kevquirk.com/fedipoll</a><!-- raw HTML omitted --></p>\n",
				"content_text": "I'm going to be having some fun on the Fediverse over the next few days/weeks. Please join in.   \r\n                <br><a href=\"https://kevquirk.com/fedipoll\">https://kevquirk.com/fedipoll</a>\n",
				"date_published": "2023-02-06T10:17:00+01:00",
				"url": "https://qrk.social/2023/02/06/im-going-to.html"
			}
	]
}
